PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
/***************************************************************************//**
* \file cyip_usbhs.h
*
* \brief
* USBHS IP definitions
*
********************************************************************************
* \copyright
* (c) (2016-2025), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#ifndef _CYIP_USBHS_H_
#define _CYIP_USBHS_H_

#include "cyip_headers.h"

/*******************************************************************************
*                                    USBHS
*******************************************************************************/

#define USBHS_DWC_OTG_INTREG_SECTION_SIZE       0x00000F00UL
#define USBHS_SS_SECTION_SIZE                   0x00000100UL
#define USBHS_SECTION_SIZE                      0x00080000UL

/**
  * \brief Internal register map (USBHS_DWC_OTG_INTREG)
  */
typedef struct
{
    __IOM uint32_t GOTGCTL;                       /*!< 0x00000000 The OTG Control and Status register controls the behavior and
                                                                reflects the status of the OTG function of the controller. */
    __IOM uint32_t GOTGINT;                       /*!< 0x00000004 The application reads this register whenever there is an OTG
                                                                interrupt and clears the bits in this register to clear the OTG
                                                                interrupt. */
    __IOM uint32_t GAHBCFG;                       /*!< 0x00000008 This register can be used to configure the core after power-on
                                                                or a change in mode. This register mainly contains AHB
                                                                system-related configuration parameters. Do not change this
                                                                register after the initial programming. The application must
                                                                program this register before starting any transactions on either
                                                                the AHB or the USB. */
    __IOM uint32_t GUSBCFG;                       /*!< 0x0000000C This register can be used to configure the core after power-on
                                                                or when changing to Host mode or Device mode. It contains USB
                                                                and USB-PHY related configuration parameters. The application
                                                                must program this register before starting any transactions on
                                                                either the AHB or the USB. If you are using the HSIC interface,
                                                                HSIC PHY must be in reset while programming this register. Do
                                                                not make changes to this register after the initial programming. */
    __IOM uint32_t GRSTCTL;                       /*!< 0x00000010 The application uses this register to reset various hardware
                                                                features inside the controller. */
    __IOM uint32_t GINTSTS;                       /*!< 0x00000014 This register interrupts the application for system-level
                                                                events in the current mode (Device mode or Host mode). Some of
                                                                the bits in this register are valid only in Host mode, while
                                                                others are valid in Device mode only. This register also
                                                                indicates the current mode. To clear the interrupt status bits
                                                                of type R_SS_WC, the application must write 1'b1 to the bit. The
                                                                FIFO status interrupts are read only; once software reads from
                                                                or writes to the FIFO while servicing these interrupts, FIFO
                                                                interrupt conditions are cleared automatically. The application
                                                                must clear the GINTSTS register at initialization before
                                                                unmasking the interrupt bit to avoid any interrupts generated
                                                                prior to initialization. Note: Read the reset value of
                                                                GINTSTS.CurMod only after the following conditions: - If
                                                                IDDIG_FILTER is disabled, read only after PHY clock is stable. -
                                                                If IDDIG_FILTER is enabled, read only after the filter timer
                                                                expires. */
    __IOM uint32_t GINTMSK;                       /*!< 0x00000018 This register works with the Interrupt Register (GINTSTS) to
                                                                interrupt the application. When an interrupt bit is masked, the
                                                                interrupt associated with that bit is not generated. However,
                                                                the GINTSTS register bit corresponding to that interrupt is
                                                                still set. Note: The fields of this register change depending on
                                                                host or device mode. */
    __IM uint32_t GRXSTSR;                       /*!< 0x0000001C A read to the Receive Status Debug Read register returns the
                                                                contents of the top of the Receive FIFO. The receive status
                                                                contents must be interpreted differently in Host and Device
                                                                modes. The core ignores the receive status read when the receive
                                                                FIFO is empty and returns a value of 32'h0000_0000. Note: - Use
                                                                of these fields vary based on whether the core is functioning as
                                                                a host or a device. - Do not read this register's reset value
                                                                before configuring the core because the read value is 'X' in the
                                                                simulation. */
    __IM uint32_t GRXSTSP;                       /*!< 0x00000020 A read to the Receive Status Read and Pop register returns the
                                                                contents of the top of the Receive FIFO and additionally pops
                                                                the top data entry out of the RxFIFO. The receive status
                                                                contents must be interpreted differently in Host and Device
                                                                modes. The core ignores the receive status pop/read when the
                                                                receive FIFO is empty and returns a value of 32'h0000_0000. The
                                                                application must only pop the Receive Status FIFO when the
                                                                Receive FIFO Non-Empty bit of the Core Interrupt register
                                                                (GINTSTS.RxFLvl) is asserted. Note: - Use of these fields vary
                                                                based on whether the core is functioning as a host or a device.
                                                                - Do not read this register's reset value before configuring the
                                                                core because the read value is 'X' in the simulation. */
    __IOM uint32_t GRXFSIZ;                       /*!< 0x00000024 The application can program the RAM size that must be allocated
                                                                to the RxFIFO. */
    __IOM uint32_t GNPTXFSIZ;                     /*!< 0x00000028 The application can program the RAM size and the memory start
                                                                address for the Non-periodic TxFIFO Note: The fields of this
                                                                register change depending on host or device mode. */
    __IM uint32_t GNPTXSTS;                      /*!< 0x0000002C In Device mode, this register is valid only in Shared FIFO
                                                                operation. This read-only register contains the free space
                                                                information for the Non-periodic TxFIFO and the Non-periodic
                                                                Transmit Request Queue. */
    __IM uint32_t RESERVED[2];
    __IOM uint32_t GGPIO;                         /*!< 0x00000038 The application can use this register for general purpose
                                                                input/output ports or for debugging. */
    __IOM uint32_t GUID;                          /*!< 0x0000003C This is a read/write register containing the User ID. It is
                                                                implemented only if Remove Optional Features? was deselected
                                                                during coreConsultant configuration (parameter
                                                                OTG_RM_OPT_FEATURES = 0). The power-on value for this register
                                                                is specified as the Power-on Value of User ID Register User
                                                                Identification Register during coreConsultant configuration
                                                                (parameter OTG_USERID). This register can be used in the
                                                                following ways: - To store the version or revision of your
                                                                system - To store hardware configurations that are outside the
                                                                DWC_otg core - As a scratch register */
    __IM uint32_t GSNPSID;                       /*!< 0x00000040 This read-only register contains the release number of the core
                                                                being used. */
    __IM uint32_t GHWCFG1;                       /*!< 0x00000044 This register contains the logical endpoint direction(s)
                                                                selected using coreConsultant. */
    __IM uint32_t GHWCFG2;                       /*!< 0x00000048 This register contains configuration options selected using
                                                                coreConsultant. */
    __IM uint32_t GHWCFG3;                       /*!< 0x0000004C This register contains configuration options selected using
                                                                coreConsultant. */
    __IM uint32_t GHWCFG4;                       /*!< 0x00000050 This register contains configuration options selected using
                                                                coreConsultant. Note: Bit [31] is available only when
                                                                Scatter/Gather DMA mode is enabled. When Scatter/Gather DMA mode
                                                                is disabled, this field is reserved. */
    __IOM uint32_t GLPMCFG;                       /*!< 0x00000054 Register to control the LPM functionality of the controller. */
    __IM uint32_t RESERVED1;
    __IOM uint32_t GDFIFOCFG;                     /*!< 0x0000005C Register to configure the DFIFOs for the controller. */
    __IM uint32_t RESERVED2[2];
    __IOM uint32_t GINTMSK2;                      /*!< 0x00000068 This register works with the Interrupt Register (GINTSTS2) to
                                                                interrupt the application. When an interrupt bit is masked, the
                                                                interrupt associated with that bit is not generated. However,
                                                                the GINTSTS2 register bit corresponding to that interrupt is
                                                                still set. Note: The fields of this register change depending on
                                                                host or device mode. */
    __IOM uint32_t GINTSTS2;                      /*!< 0x0000006C This register interrupts the application for system-level
                                                                events in the current mode (Device mode or Host mode). Some of
                                                                the bits in this register are valid only in Host mode, while
                                                                others are valid in Device mode only. This register also
                                                                indicates the current mode. To clear the interrupt status bits
                                                                of type R_SS_WC, the application must write 1'b1 to the bit. The
                                                                application must clear the GINTSTS2 register at initialization
                                                                before unmasking the interrupt bit to avoid any interrupts
                                                                generated prior to initialization. */
    __IM uint32_t RESERVED3[36];
    __IOM uint32_t HPTXFSIZ;                      /*!< 0x00000100 This register holds the size and the memory start address of
                                                                the Periodic TxFIFO. Note: Read the reset value of this register
                                                                only after the following conditions: - If IDDIG_FILTER is
                                                                disabled, read only after PHY clock is stable. - If IDDIG_FILTER
                                                                is enabled, read only after the filter timer expires. */
    __IOM uint32_t DIEPTXF1;                      /*!< 0x00000104 This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF2;                      /*!< 0x00000108 This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF3;                      /*!< 0x0000010C This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF4;                      /*!< 0x00000110 This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF5;                      /*!< 0x00000114 This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF6;                      /*!< 0x00000118 This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF7;                      /*!< 0x0000011C This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IOM uint32_t DIEPTXF8;                      /*!< 0x00000120 This register is valid only in dedicated FIFO mode
                                                                (OTG_EN_DED_TX_FIFO=1). It holds the size and memory start
                                                                address of IN endpoint TxFIFOs implemented in Device mode. Each
                                                                FIFO holds the data for one IN endpoint. This register is
                                                                repeated for instantiated IN endpoint FIFOs 1 to 15. For IN
                                                                endpoint FIFO 0, use GNPTXFSIZ register for programming the size
                                                                and memory start address. */
    __IM uint32_t RESERVED4[183];
    __IOM uint32_t HCFG;                          /*!< 0x00000400 This register is used to configure the controller in Host mode. */
    __IOM uint32_t HFIR;                          /*!< 0x00000404 This register is used to control the interval between two
                                                                consecutive SOFs. */
    __IM uint32_t HFNUM;                         /*!< 0x00000408 This register indicates the current frame number. It also
                                                                indicates the time remaining (in terms of the number of PHY
                                                                clocks) in the current (micro)frame. Note: Read the reset value
                                                                of this register only after the following conditions: - If
                                                                IDDIG_FILTER is disabled, read only when the PHY clock is
                                                                stable. - If IDDIG_FILTER is enabled, read only after the filter
                                                                timer expires. */
    __IM uint32_t RESERVED5;
    __IM uint32_t HPTXSTS;                       /*!< 0x00000410 This register contains information about the Periodic Transmit
