PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
                                                                Queue in the Host controller. */
    __IM uint32_t HAINT;                         /*!< 0x00000414 When a significant event occurs on a channel, the Host All
                                                                Channels Interrupt register interrupts the application using the
                                                                Host Channels Interrupt bit of the Core Interrupt register
                                                                (GINTSTS.HChInt). This is shown in the 'Interrupt Hierarchy'
                                                                figure in the databook. There is one interrupt bit per channel,
                                                                up to a maximum of 16 bits. Bits in this register are set and
                                                                cleared when the application sets and clears bits in the
                                                                corresponding Host Channel-n Interrupt register. */
    __IOM uint32_t HAINTMSK;                      /*!< 0x00000418 The Host All Channel Interrupt Mask register works with the
                                                                Host All Channel Interrupt register to interrupt the application
                                                                when an event occurs on a channel. There is one interrupt mask
                                                                bit per channel, up to a maximum of 16 bits. */
    __IOM uint32_t HFLBADDR;                      /*!< 0x0000041C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented as flops. This register holds the starting
                                                                address of the Frame list information. */
    __IM uint32_t RESERVED6[8];
    __IOM uint32_t HPRT;                          /*!< 0x00000440 This register is available only in Host mode. Currently, the
                                                                OTG Host supports only one port. A single register holds USB
                                                                port-related information such as USB reset, enable, suspend,
                                                                resume, connect status, and test mode for each port. It is shown
                                                                in the 'Interrupt Hierarchy' figure in the databook. The R_SS_WC
                                                                bits in this register can trigger an interrupt to the
                                                                application through the Host Port Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.PrtInt). On a Port Interrupt, the
                                                                application must read this register and clear the bit that
                                                                caused the interrupt. For the R_SS_WC bits, the application must
                                                                write a 1 to the bit to clear the interrupt. */
    __IM uint32_t RESERVED7[47];
    __IOM uint32_t HCCHAR0;                       /*!< 0x00000500 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT0;                       /*!< 0x00000504 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT0;                        /*!< 0x00000508 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK0;                     /*!< 0x0000050C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ0;                       /*!< 0x00000510 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA0;                        /*!< 0x00000514 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED8;
    __IM uint32_t HCDMAB0;                       /*!< 0x0000051C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR1;                       /*!< 0x00000520 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT1;                       /*!< 0x00000524 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT1;                        /*!< 0x00000528 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK1;                     /*!< 0x0000052C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ1;                       /*!< 0x00000530 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA1;                        /*!< 0x00000534 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED9;
    __IM uint32_t HCDMAB1;                       /*!< 0x0000053C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR2;                       /*!< 0x00000540 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT2;                       /*!< 0x00000544 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT2;                        /*!< 0x00000548 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK2;                     /*!< 0x0000054C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ2;                       /*!< 0x00000550 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA2;                        /*!< 0x00000554 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED10;
    __IM uint32_t HCDMAB2;                       /*!< 0x0000055C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR3;                       /*!< 0x00000560 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT3;                       /*!< 0x00000564 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT3;                        /*!< 0x00000568 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK3;                     /*!< 0x0000056C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ3;                       /*!< 0x00000570 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA3;                        /*!< 0x00000574 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED11;
    __IM uint32_t HCDMAB3;                       /*!< 0x0000057C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR4;                       /*!< 0x00000580 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT4;                       /*!< 0x00000584 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT4;                        /*!< 0x00000588 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK4;                     /*!< 0x0000058C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ4;                       /*!< 0x00000590 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA4;                        /*!< 0x00000594 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED12;
    __IM uint32_t HCDMAB4;                       /*!< 0x0000059C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR5;                       /*!< 0x000005A0 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT5;                       /*!< 0x000005A4 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT5;                        /*!< 0x000005A8 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK5;                     /*!< 0x000005AC This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ5;                       /*!< 0x000005B0 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA5;                        /*!< 0x000005B4 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED13;
    __IM uint32_t HCDMAB5;                       /*!< 0x000005BC This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR6;                       /*!< 0x000005C0 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT6;                       /*!< 0x000005C4 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT6;                        /*!< 0x000005C8 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK6;                     /*!< 0x000005CC This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ6;                       /*!< 0x000005D0 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA6;                        /*!< 0x000005D4 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED14;
    __IM uint32_t HCDMAB6;                       /*!< 0x000005DC This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR7;                       /*!< 0x000005E0 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT7;                       /*!< 0x000005E4 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT7;                        /*!< 0x000005E8 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
