PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK7;                     /*!< 0x000005EC This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ7;                       /*!< 0x000005F0 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA7;                        /*!< 0x000005F4 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED15;
    __IM uint32_t HCDMAB7;                       /*!< 0x000005FC This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR8;                       /*!< 0x00000600 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT8;                       /*!< 0x00000604 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT8;                        /*!< 0x00000608 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK8;                     /*!< 0x0000060C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ8;                       /*!< 0x00000610 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA8;                        /*!< 0x00000614 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED16;
    __IM uint32_t HCDMAB8;                       /*!< 0x0000061C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR9;                       /*!< 0x00000620 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT9;                       /*!< 0x00000624 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT9;                        /*!< 0x00000628 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK9;                     /*!< 0x0000062C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ9;                       /*!< 0x00000630 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA9;                        /*!< 0x00000634 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED17;
    __IM uint32_t HCDMAB9;                       /*!< 0x0000063C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR10;                      /*!< 0x00000640 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT10;                      /*!< 0x00000644 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT10;                       /*!< 0x00000648 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK10;                    /*!< 0x0000064C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ10;                      /*!< 0x00000650 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA10;                       /*!< 0x00000654 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED18;
    __IM uint32_t HCDMAB10;                      /*!< 0x0000065C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR11;                      /*!< 0x00000660 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT11;                      /*!< 0x00000664 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT11;                       /*!< 0x00000668 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK11;                    /*!< 0x0000066C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ11;                      /*!< 0x00000670 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA11;                       /*!< 0x00000674 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED19;
    __IM uint32_t HCDMAB11;                      /*!< 0x0000067C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR12;                      /*!< 0x00000680 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT12;                      /*!< 0x00000684 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT12;                       /*!< 0x00000688 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK12;                    /*!< 0x0000068C This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ12;                      /*!< 0x00000690 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA12;                       /*!< 0x00000694 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED20;
    __IM uint32_t HCDMAB12;                      /*!< 0x0000069C This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR13;                      /*!< 0x000006A0 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT13;                      /*!< 0x000006A4 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT13;                       /*!< 0x000006A8 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK13;                    /*!< 0x000006AC This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ13;                      /*!< 0x000006B0 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA13;                       /*!< 0x000006B4 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED21;
    __IM uint32_t HCDMAB13;                      /*!< 0x000006BC This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR14;                      /*!< 0x000006C0 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT14;                      /*!< 0x000006C4 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT14;                       /*!< 0x000006C8 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK14;                    /*!< 0x000006CC This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ14;                      /*!< 0x000006D0 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA14;                       /*!< 0x000006D4 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED22;
    __IM uint32_t HCDMAB14;                      /*!< 0x000006DC This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IOM uint32_t HCCHAR15;                      /*!< 0x000006E0 This register contains the characteristics of the Host Channel. */
    __IOM uint32_t HCSPLT15;                      /*!< 0x000006E4 This register contains the Split characteristics of the Host
                                                                Channel. */
    __IOM uint32_t HCINT15;                       /*!< 0x000006E8 This register indicates the status of a channel with respect to
                                                                USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the Host Channels Interrupt bit of the Core
                                                                Interrupt register (GINTSTS.HChInt) is set. Before the
                                                                application can read this register, it must first read the Host
                                                                All Channels Interrupt (HAINT) register to get the exact channel
                                                                number for the Host Channel-n Interrupt register. The
                                                                application must clear the appropriate bit in this register to
                                                                clear the corresponding bits in the HAINT and GINTSTS registers. */
    __IOM uint32_t HCINTMSK15;                    /*!< 0x000006EC This register reflects the mask for each channel status
                                                                described in the previous section. */
    __IOM uint32_t HCTSIZ15;                      /*!< 0x000006F0 This register reflects the transfer size for the Host Channel. */
    __IOM uint32_t HCDMA15;                       /*!< 0x000006F4 This register is used by the OTG host in the internal DMA mode
                                                                to maintain the current buffer pointer for IN/OUT transactions.
                                                                The starting DMA address must be DWORD-aligned. */
    __IM uint32_t RESERVED23;
    __IM uint32_t HCDMAB15;                      /*!< 0x000006FC This register is present only in case of Scatter/Gather DMA. It
                                                                is implemented in RAM instead of flop-based implementation. This
                                                                register holds the current buffer address. */
    __IM uint32_t RESERVED24[64];
    __IOM uint32_t DCFG;                          /*!< 0x00000800 This register configures the core in Device mode after power-on
                                                                or after certain control commands or enumeration. Do not make
                                                                changes to this register after initial programming. */
    __IOM uint32_t DCTL;                          /*!< 0x00000804 This register is used to control the characteristics of the
                                                                Device controller. */
    __IM uint32_t DSTS;                          /*!< 0x00000808 This register indicates the status of the core with respect to
                                                                USB-related events. It must be read on interrupts from Device
                                                                All Interrupts (DAINT) register. */
