PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
    __IM uint32_t RESERVED25;
    __IOM uint32_t DIEPMSK;                       /*!< 0x00000810 This register works with each of the Device IN Endpoint
                                                                Interrupt (DIEPINTn) registers for all endpoints to generate an
                                                                interrupt per IN endpoint. The IN endpoint interrupt for a
                                                                specific status in the DIEPINTn register can be masked by
                                                                writing to the corresponding bit in this register. Status bits
                                                                are masked by default. */
    __IOM uint32_t DOEPMSK;                       /*!< 0x00000814 This register works with each of the Device OUT Endpoint
                                                                Interrupt (DOEPINTn) registers for all endpoints to generate an
                                                                interrupt per OUT endpoint. The OUT endpoint interrupt for a
                                                                specific status in the DOEPINTn register can be masked by
                                                                writing into the corresponding bit in this register. Status bits
                                                                are masked by default. */
    __IM uint32_t DAINT;                         /*!< 0x00000818 When a significant event occurs on an endpoint, a Device All
                                                                Endpoints Interrupt register interrupts the application using
                                                                the Device OUT Endpoints Interrupt bit or Device IN Endpoints
                                                                Interrupt bit of the Core Interrupt register (GINTSTS.OEPInt or
                                                                GINTSTS.IEPInt, respectively). This is shown in Figure 5-2.
                                                                There is one interrupt bit per endpoint, up to a maximum of 16
                                                                bits for OUT endpoints and 16 bits for IN endpoints. For a
                                                                bidirectional endpoint, the corresponding IN and OUT interrupt
                                                                bits are used. Bits in this register are set and cleared when
                                                                the application sets and clears bits in the corresponding Device
                                                                Endpoint-n Interrupt register (DIEPINTn/DOEPINTn). */
    __IOM uint32_t DAINTMSK;                      /*!< 0x0000081C The Device Endpoint Interrupt Mask register works with the
                                                                Device Endpoint Interrupt register to interrupt the application
                                                                when an event occurs on a device endpoint. However, the Device
                                                                All Endpoints Interrupt (DAINT) register bit corresponding to
                                                                that interrupt is still set. */
    __IM uint32_t RESERVED26[2];
    __IOM uint32_t DVBUSDIS;                      /*!< 0x00000828 This register specifies the VBUS discharge time after VBUS
                                                                pulsing during SRP. */
    __IOM uint32_t DVBUSPULSE;                    /*!< 0x0000082C This register contains the VBUS pulsing time during SRP. */
    __IOM uint32_t DTHRCTL;                       /*!< 0x00000830 This register contains the Receive and Transmit Threshold
                                                                characteristics of the Device controller. */
    __IOM uint32_t DIEPEMPMSK;                    /*!< 0x00000834 This register is valid only in Dedicated FIFO operation
                                                                (OTG_EN_DED_TX_FIFO = 1). This register is used to control the
                                                                IN endpoint FIFO empty interrupt generation (DIEPINTn.TxfEmp). */
    __IM uint32_t RESERVED27[50];
    __IOM uint32_t DIEPCTL0;                      /*!< 0x00000900 This register is used to control the characteristics of the IN
                                                                Endpoint 0 of the Device controller. */
    __IM uint32_t RESERVED28;
    __IOM uint32_t DIEPINT0;                      /*!< 0x00000908 This register indicates the status of an endpoint with respect
                                                                to USB- and AHB-related events. It is shown in the 'Interrupt
                                                                Hierarchy' figure in the databook. The application must read
                                                                this register when the OUT Endpoints Interrupt bit or IN
                                                                Endpoints Interrupt bit of the Core Interrupt register
                                                                (GINTSTS.OEPInt or GINTSTS.IEPInt, respectively) is set. Before
                                                                the application can read this register, it must first read the
                                                                Device All Endpoints Interrupt (DAINT) register to get the exact
                                                                endpoint number for the Device Endpoint-n Interrupt register.
                                                                The application must clear the appropriate bit in this register
                                                                to clear the corresponding bits in the DAINT and GINTSTS
                                                                registers */
    __IM uint32_t RESERVED29;
    __IOM uint32_t DIEPTSIZ0;                     /*!< 0x00000910 The application must modify this register before enabling
                                                                endpoint 0. Once endpoint 0 is enabled using Endpoint Enable bit
                                                                of the Device Control Endpoint 0 Control registers
                                                                (DIEPCTL0.EPEna/DOEPCTL0.EPEna), the core modifies this
                                                                register. The application can only read this register once the
                                                                core has cleared the Endpoint Enable bit. Nonzero endpoints use
                                                                the registers for endpoints 115. When Scatter/Gather DMA mode is
                                                                enabled, this register must not be programmed by the
                                                                application. If the application reads this register when
                                                                Scatter/Gather DMA mode is enabled, the core returns all zeros. */
    __IOM uint32_t DIEPDMA0;                      /*!< 0x00000914 This register contains the DMA Address for the IN Endpoint 0 of
                                                                the Device controller. */
    __IM uint32_t DTXFSTS0;                      /*!< 0x00000918 This register contains information about the IN Endpoint
                                                                Transmit FIFO of the Device controller. */
    __IM uint32_t DIEPDMAB0;                     /*!< 0x0000091C This register contains the DMA Buffer Address for the IN
                                                                Endpoint 0 of the Device controller. */
    __IOM uint32_t DIEPCTL1;                      /*!< 0x00000920 This register is used to control the characteristics of
                                                                Endpoint 1. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED30;
    __IOM uint32_t DIEPINT1;                      /*!< 0x00000928 This register contains the interrupts for the IN Endpoint 1 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED31;
    __IOM uint32_t DIEPTSIZ1;                     /*!< 0x00000930 This register reflects the Transfer Size of the IN Endpoint 1
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA1;                      /*!< 0x00000934 This register contains the DMA Address for the IN Endpoint 1 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS1;                      /*!< 0x00000938 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 1 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB1;                     /*!< 0x0000093C This register contains the DMA Buffer Address of the IN
                                                                Endpoint 1 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL2;                      /*!< 0x00000940 This register is used to control the characteristics of
                                                                Endpoint 2. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED32;
    __IOM uint32_t DIEPINT2;                      /*!< 0x00000948 This register contains the interrupts for the IN Endpoint 2 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED33;
    __IOM uint32_t DIEPTSIZ2;                     /*!< 0x00000950 This register reflects the Transfer Size of the IN Endpoint 2
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA2;                      /*!< 0x00000954 This register contains the DMA Address for the IN Endpoint 2 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS2;                      /*!< 0x00000958 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 2 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB2;                     /*!< 0x0000095C This register contains the DMA Buffer Address of the IN
                                                                Endpoint 2 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL3;                      /*!< 0x00000960 This register is used to control the characteristics of
                                                                Endpoint 3. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED34;
    __IOM uint32_t DIEPINT3;                      /*!< 0x00000968 This register contains the interrupts for the IN Endpoint 3 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED35;
    __IOM uint32_t DIEPTSIZ3;                     /*!< 0x00000970 This register reflects the Transfer Size of the IN Endpoint 3
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA3;                      /*!< 0x00000974 This register contains the DMA Address for the IN Endpoint 3 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS3;                      /*!< 0x00000978 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 3 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB3;                     /*!< 0x0000097C This register contains the DMA Buffer Address of the IN
                                                                Endpoint 3 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL4;                      /*!< 0x00000980 This register is used to control the characteristics of
                                                                Endpoint 4. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED36;
    __IOM uint32_t DIEPINT4;                      /*!< 0x00000988 This register contains the interrupts for the IN Endpoint 4 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED37;
    __IOM uint32_t DIEPTSIZ4;                     /*!< 0x00000990 This register reflects the Transfer Size of the IN Endpoint 4
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA4;                      /*!< 0x00000994 This register contains the DMA Address for the IN Endpoint 4 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS4;                      /*!< 0x00000998 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 4 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB4;                     /*!< 0x0000099C This register contains the DMA Buffer Address of the IN
                                                                Endpoint 4 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL5;                      /*!< 0x000009A0 This register is used to control the characteristics of
                                                                Endpoint 5. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED38;
    __IOM uint32_t DIEPINT5;                      /*!< 0x000009A8 This register contains the interrupts for the IN Endpoint 5 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED39;
    __IOM uint32_t DIEPTSIZ5;                     /*!< 0x000009B0 This register reflects the Transfer Size of the IN Endpoint 5
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA5;                      /*!< 0x000009B4 This register contains the DMA Address for the IN Endpoint 5 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS5;                      /*!< 0x000009B8 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 5 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB5;                     /*!< 0x000009BC This register contains the DMA Buffer Address of the IN
                                                                Endpoint 5 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL6;                      /*!< 0x000009C0 This register is used to control the characteristics of
                                                                Endpoint 6. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED40;
    __IOM uint32_t DIEPINT6;                      /*!< 0x000009C8 This register contains the interrupts for the IN Endpoint 6 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED41;
    __IOM uint32_t DIEPTSIZ6;                     /*!< 0x000009D0 This register reflects the Transfer Size of the IN Endpoint 6
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA6;                      /*!< 0x000009D4 This register contains the DMA Address for the IN Endpoint 6 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS6;                      /*!< 0x000009D8 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 6 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
