PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
    __IM uint32_t DIEPDMAB6;                     /*!< 0x000009DC This register contains the DMA Buffer Address of the IN
                                                                Endpoint 6 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL7;                      /*!< 0x000009E0 This register is used to control the characteristics of
                                                                Endpoint 7. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED42;
    __IOM uint32_t DIEPINT7;                      /*!< 0x000009E8 This register contains the interrupts for the IN Endpoint 7 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED43;
    __IOM uint32_t DIEPTSIZ7;                     /*!< 0x000009F0 This register reflects the Transfer Size of the IN Endpoint 7
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA7;                      /*!< 0x000009F4 This register contains the DMA Address for the IN Endpoint 7 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS7;                      /*!< 0x000009F8 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 7 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB7;                     /*!< 0x000009FC This register contains the DMA Buffer Address of the IN
                                                                Endpoint 7 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IOM uint32_t DIEPCTL8;                      /*!< 0x00000A00 This register is used to control the characteristics of
                                                                Endpoint 8. Note: This register exists for an endpoint i if the
                                                                OTG_EP_DIR_i parameter is 0 or 1 for that endpoint. */
    __IM uint32_t RESERVED44;
    __IOM uint32_t DIEPINT8;                      /*!< 0x00000A08 This register contains the interrupts for the IN Endpoint 8 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t RESERVED45;
    __IOM uint32_t DIEPTSIZ8;                     /*!< 0x00000A10 This register reflects the Transfer Size of the IN Endpoint 8
                                                                of the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IOM uint32_t DIEPDMA8;                      /*!< 0x00000A14 This register contains the DMA Address for the IN Endpoint 8 of
                                                                the Device controller. Note: This register exists for an
                                                                endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that
                                                                endpoint. */
    __IM uint32_t DTXFSTS8;                      /*!< 0x00000A18 This register reflects the status of the IN Endpoint Transmit
                                                                FIFO Status Register 8 of the Device controller. Note: This
                                                                register exists for an endpoint i if the OTG_EP_DIR_i parameter
                                                                is 0 or 1 for that endpoint. */
    __IM uint32_t DIEPDMAB8;                     /*!< 0x00000A1C This register contains the DMA Buffer Address of the IN
                                                                Endpoint 8 of the Device controller. Note: This register exists
                                                                for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for
                                                                that endpoint. */
    __IM uint32_t RESERVED46[56];
    __IOM uint32_t DOEPCTL0;                      /*!< 0x00000B00 This register is used to control the characteristics of the OUT
                                                                Endpoint 0 of the Device controller. */
    __IM uint32_t RESERVED47;
    __IOM uint32_t DOEPINT0;                      /*!< 0x00000B08 This register contains the interrupts for the OUT Endpoint 0 of
                                                                the Device controller. */
    __IM uint32_t RESERVED48;
    __IOM uint32_t DOEPTSIZ0;                     /*!< 0x00000B10 This register contains the Transfer Size for the OUT Endpoint 0
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA0;                      /*!< 0x00000B14 This register contains the DMA Address for the OUT Endpoint 0
                                                                of the Device controller. */
    __IM uint32_t RESERVED49;
    __IM uint32_t DOEPDMAB0;                     /*!< 0x00000B1C This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 0 of the Device controller. */
    __IOM uint32_t DOEPCTL1;                      /*!< 0x00000B20 This register is used to control the characteristics of OUT
                                                                Endpoint 1 of the Device controller. */
    __IM uint32_t RESERVED50;
    __IOM uint32_t DOEPINT1;                      /*!< 0x00000B28 This register contains the interrupts for the OUT Endpoint 1 of
                                                                the Device controller. */
    __IM uint32_t RESERVED51;
    __IOM uint32_t DOEPTSIZ1;                     /*!< 0x00000B30 This register contains the Transfer Size for the OUT Endpoint 1
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA1;                      /*!< 0x00000B34 This register contains the DMA Address for the OUT Endpoint 1
                                                                of the Device controller. */
    __IM uint32_t RESERVED52;
    __IM uint32_t DOEPDMAB1;                     /*!< 0x00000B3C This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 1 of the Device controller. */
    __IOM uint32_t DOEPCTL2;                      /*!< 0x00000B40 This register is used to control the characteristics of OUT
                                                                Endpoint 2 of the Device controller. */
    __IM uint32_t RESERVED53;
    __IOM uint32_t DOEPINT2;                      /*!< 0x00000B48 This register contains the interrupts for the OUT Endpoint 2 of
                                                                the Device controller. */
    __IM uint32_t RESERVED54;
    __IOM uint32_t DOEPTSIZ2;                     /*!< 0x00000B50 This register contains the Transfer Size for the OUT Endpoint 2
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA2;                      /*!< 0x00000B54 This register contains the DMA Address for the OUT Endpoint 2
                                                                of the Device controller. */
    __IM uint32_t RESERVED55;
    __IM uint32_t DOEPDMAB2;                     /*!< 0x00000B5C This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 2 of the Device controller. */
    __IOM uint32_t DOEPCTL3;                      /*!< 0x00000B60 This register is used to control the characteristics of OUT
                                                                Endpoint 3 of the Device controller. */
    __IM uint32_t RESERVED56;
    __IOM uint32_t DOEPINT3;                      /*!< 0x00000B68 This register contains the interrupts for the OUT Endpoint 3 of
                                                                the Device controller. */
    __IM uint32_t RESERVED57;
    __IOM uint32_t DOEPTSIZ3;                     /*!< 0x00000B70 This register contains the Transfer Size for the OUT Endpoint 3
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA3;                      /*!< 0x00000B74 This register contains the DMA Address for the OUT Endpoint 3
                                                                of the Device controller. */
    __IM uint32_t RESERVED58;
    __IM uint32_t DOEPDMAB3;                     /*!< 0x00000B7C This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 3 of the Device controller. */
    __IOM uint32_t DOEPCTL4;                      /*!< 0x00000B80 This register is used to control the characteristics of OUT
                                                                Endpoint 4 of the Device controller. */
    __IM uint32_t RESERVED59;
    __IOM uint32_t DOEPINT4;                      /*!< 0x00000B88 This register contains the interrupts for the OUT Endpoint 4 of
                                                                the Device controller. */
    __IM uint32_t RESERVED60;
    __IOM uint32_t DOEPTSIZ4;                     /*!< 0x00000B90 This register contains the Transfer Size for the OUT Endpoint 4
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA4;                      /*!< 0x00000B94 This register contains the DMA Address for the OUT Endpoint 4
                                                                of the Device controller. */
    __IM uint32_t RESERVED61;
    __IM uint32_t DOEPDMAB4;                     /*!< 0x00000B9C This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 4 of the Device controller. */
    __IOM uint32_t DOEPCTL5;                      /*!< 0x00000BA0 This register is used to control the characteristics of OUT
                                                                Endpoint 5 of the Device controller. */
    __IM uint32_t RESERVED62;
    __IOM uint32_t DOEPINT5;                      /*!< 0x00000BA8 This register contains the interrupts for the OUT Endpoint 5 of
                                                                the Device controller. */
    __IM uint32_t RESERVED63;
    __IOM uint32_t DOEPTSIZ5;                     /*!< 0x00000BB0 This register contains the Transfer Size for the OUT Endpoint 5
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA5;                      /*!< 0x00000BB4 This register contains the DMA Address for the OUT Endpoint 5
                                                                of the Device controller. */
    __IM uint32_t RESERVED64;
    __IM uint32_t DOEPDMAB5;                     /*!< 0x00000BBC This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 5 of the Device controller. */
    __IOM uint32_t DOEPCTL6;                      /*!< 0x00000BC0 This register is used to control the characteristics of OUT
                                                                Endpoint 6 of the Device controller. */
    __IM uint32_t RESERVED65;
    __IOM uint32_t DOEPINT6;                      /*!< 0x00000BC8 This register contains the interrupts for the OUT Endpoint 6 of
                                                                the Device controller. */
    __IM uint32_t RESERVED66;
    __IOM uint32_t DOEPTSIZ6;                     /*!< 0x00000BD0 This register contains the Transfer Size for the OUT Endpoint 6
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA6;                      /*!< 0x00000BD4 This register contains the DMA Address for the OUT Endpoint 6
                                                                of the Device controller. */
    __IM uint32_t RESERVED67;
    __IM uint32_t DOEPDMAB6;                     /*!< 0x00000BDC This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 6 of the Device controller. */
    __IOM uint32_t DOEPCTL7;                      /*!< 0x00000BE0 This register is used to control the characteristics of OUT
                                                                Endpoint 7 of the Device controller. */
    __IM uint32_t RESERVED68;
    __IOM uint32_t DOEPINT7;                      /*!< 0x00000BE8 This register contains the interrupts for the OUT Endpoint 7 of
                                                                the Device controller. */
    __IM uint32_t RESERVED69;
    __IOM uint32_t DOEPTSIZ7;                     /*!< 0x00000BF0 This register contains the Transfer Size for the OUT Endpoint 7
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA7;                      /*!< 0x00000BF4 This register contains the DMA Address for the OUT Endpoint 7
                                                                of the Device controller. */
    __IM uint32_t RESERVED70;
    __IM uint32_t DOEPDMAB7;                     /*!< 0x00000BFC This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 7 of the Device controller. */
    __IOM uint32_t DOEPCTL8;                      /*!< 0x00000C00 This register is used to control the characteristics of OUT
                                                                Endpoint 8 of the Device controller. */
    __IM uint32_t RESERVED71;
    __IOM uint32_t DOEPINT8;                      /*!< 0x00000C08 This register contains the interrupts for the OUT Endpoint 8 of
                                                                the Device controller. */
    __IM uint32_t RESERVED72;
    __IOM uint32_t DOEPTSIZ8;                     /*!< 0x00000C10 This register contains the Transfer Size for the OUT Endpoint 8
                                                                of the Device controller. */
    __IOM uint32_t DOEPDMA8;                      /*!< 0x00000C14 This register contains the DMA Address for the OUT Endpoint 8
                                                                of the Device controller. */
    __IM uint32_t RESERVED73;
    __IM uint32_t DOEPDMAB8;                     /*!< 0x00000C1C This register contains the DMA Buffer Address for the OUT
                                                                Endpoint 8 of the Device controller. */
    __IM uint32_t RESERVED74[120];
    __IOM uint32_t PCGCCTL;                       /*!< 0x00000E00 This register is used to control the Power and Clock Gating
                                                                characteristics of the controller. */
    __IOM uint32_t PCGCCTL1;                      /*!< 0x00000E04 This register is used to control the Power and Clock Gating
                                                                characteristics of the controller. */
    __IM uint32_t RESERVED75[62];
} USBHS_DWC_OTG_INTREG_Type;                    /*!< Size = 3840 (0xF00) */

/**
  * \brief USBHS Subsystem, Controller, PHY control,configuration and status registers (USBHS_SS)
  */
typedef struct
{
    __IOM uint32_t SUBSYSTEM_CTL;                 /*!< 0x00000000 Subsystem level control register */
    __IOM uint32_t PHY_FUNC_CTL_1;                /*!< 0x00000004 Subsystem level- PHY functional mode control register 1 */
    __IOM uint32_t PHY_FUNC_CTL_2;                /*!< 0x00000008 Subsystem level- PHY functional mode control register 2 */
    __IOM uint32_t PHY_TEST_CTL;                  /*!< 0x0000000C Subsystem level- PHY test mode control register */
    __IOM uint32_t CONTROLLER_DDFT_CTL;           /*!< 0x00000010 Subsystem level- Controller DDFT control register */
    __IOM uint32_t INTR_SS;                       /*!< 0x00000014 Subsystem level- Interrupt register */
    __IOM uint32_t INTR_SS_SET;                   /*!< 0x00000018 Subsystem level- Interrupt set register */
    __IOM uint32_t INTR_SS_MASK;                  /*!< 0x0000001C Subsystem level- Interrupt mask register */
    __IM uint32_t INTR_SS_MASKED;                /*!< 0x00000020 Subsystem level- Interrupt masked register */
    __IM uint32_t RESERVED[55];
} USBHS_SS_Type;                                /*!< Size = 256 (0x100) */

/**
  * \brief Regmap for both Subsystem and Controller IP (USBHS)
  */
typedef struct
{
    USBHS_DWC_OTG_INTREG_Type DWC_OTG_INTREG; /*!< 0x00000000 Internal register map */
    __IM uint32_t RESERVED[64576];
    USBHS_SS_Type SS;                       /*!< 0x00040000 USBHS Subsystem, Controller, PHY control,configuration and
                                                                status registers */
} USBHS_Type;                                   /*!< Size = 262400 (0x40100) */


