PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
/* USBHS_DWC_OTG_INTREG.GOTGCTL */
#define USBHS_DWC_OTG_INTREG_GOTGCTL_VBVALIDOVEN_Pos 2UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_VBVALIDOVEN_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_VBVALIDOVVAL_Pos 3UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_VBVALIDOVVAL_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_AVALIDOVEN_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_AVALIDOVEN_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_AVALIDOVVAL_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_AVALIDOVVAL_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_BVALIDOVEN_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_BVALIDOVEN_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_BVALIDOVVAL_Pos 7UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_BVALIDOVVAL_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_DBNCEFLTRBYPASS_Pos 15UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_DBNCEFLTRBYPASS_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_CONIDSTS_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_CONIDSTS_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_DBNCTIME_Pos 17UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_DBNCTIME_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_ASESVLD_Pos 18UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_ASESVLD_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_BSESVLD_Pos 19UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_BSESVLD_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_OTGVER_Pos 20UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_OTGVER_Msk 0x100000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_CURMOD_Pos 21UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_CURMOD_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_TESTMODE_CORR_EUSB2_Pos 31UL
#define USBHS_DWC_OTG_INTREG_GOTGCTL_TESTMODE_CORR_EUSB2_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.GOTGINT */
#define USBHS_DWC_OTG_INTREG_GOTGINT_SESENDDET_Pos 2UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_SESENDDET_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_SESREQSUCSTSCHNG_Pos 8UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_SESREQSUCSTSCHNG_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_HSTNEGSUCSTSCHNG_Pos 9UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_HSTNEGSUCSTSCHNG_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_HSTNEGDET_Pos 17UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_HSTNEGDET_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_ADEVTOUTCHG_Pos 18UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_ADEVTOUTCHG_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_DBNCEDONE_Pos 19UL
#define USBHS_DWC_OTG_INTREG_GOTGINT_DBNCEDONE_Msk 0x80000UL
/* USBHS_DWC_OTG_INTREG.GAHBCFG */
#define USBHS_DWC_OTG_INTREG_GAHBCFG_GLBLINTRMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_GLBLINTRMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_HBSTLEN_Pos 1UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_HBSTLEN_Msk 0x1EUL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_DMAEN_Pos  5UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_DMAEN_Msk  0x20UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_NPTXFEMPLVL_Pos 7UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_NPTXFEMPLVL_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_PTXFEMPLVL_Pos 8UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_PTXFEMPLVL_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_REMMEMSUPP_Pos 21UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_REMMEMSUPP_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_NOTIALLDMAWRIT_Pos 22UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_NOTIALLDMAWRIT_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_AHBSINGLE_Pos 23UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_AHBSINGLE_Msk 0x800000UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_INVDESCENDIANESS_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GAHBCFG_INVDESCENDIANESS_Msk 0x1000000UL
/* USBHS_DWC_OTG_INTREG.GUSBCFG */
#define USBHS_DWC_OTG_INTREG_GUSBCFG_TOUTCAL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_TOUTCAL_Msk 0x7UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_PHYIF_Pos  3UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_PHYIF_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_ULPI_UTMI_SEL_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_ULPI_UTMI_SEL_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_FSINTF_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_FSINTF_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_PHYSEL_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_PHYSEL_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_USBTRDTIM_Pos 10UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_USBTRDTIM_Msk 0x3C00UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_PHYLPWRCLKSEL_Pos 15UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_PHYLPWRCLKSEL_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_TERMSELDLPULSE_Pos 22UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_TERMSELDLPULSE_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_IC_USBCAP_Pos 26UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_IC_USBCAP_Msk 0x4000000UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_TXENDDELAY_Pos 28UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_TXENDDELAY_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_FORCEHSTMODE_Pos 29UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_FORCEHSTMODE_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_FORCEDEVMODE_Pos 30UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_FORCEDEVMODE_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_CORRUPTTXPKT_Pos 31UL
#define USBHS_DWC_OTG_INTREG_GUSBCFG_CORRUPTTXPKT_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.GRSTCTL */
#define USBHS_DWC_OTG_INTREG_GRSTCTL_CSFTRST_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_CSFTRST_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_PIUFSSFTRST_Pos 1UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_PIUFSSFTRST_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_FRMCNTRRST_Pos 2UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_FRMCNTRRST_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_RXFFLSH_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_RXFFLSH_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_TXFFLSH_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_TXFFLSH_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_TXFNUM_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_TXFNUM_Msk 0x7C0UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_CSFTRSTDONE_Pos 29UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_CSFTRSTDONE_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_DMAREQ_Pos 30UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_DMAREQ_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_AHBIDLE_Pos 31UL
#define USBHS_DWC_OTG_INTREG_GRSTCTL_AHBIDLE_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.GINTSTS */
#define USBHS_DWC_OTG_INTREG_GINTSTS_CURMOD_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_CURMOD_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_MODEMIS_Pos 1UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_MODEMIS_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_OTGINT_Pos 2UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_OTGINT_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_SOF_Pos    3UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_SOF_Msk    0x8UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_RXFLVL_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_RXFLVL_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_NPTXFEMP_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_NPTXFEMP_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_GINNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_GINNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_GOUTNAKEFF_Pos 7UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_GOUTNAKEFF_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_ERLYSUSP_Pos 10UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_ERLYSUSP_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_USBSUSP_Pos 11UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_USBSUSP_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_USBRST_Pos 12UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_USBRST_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_ENUMDONE_Pos 13UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_ENUMDONE_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_ISOOUTDROP_Pos 14UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_ISOOUTDROP_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_EOPF_Pos   15UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_EOPF_Msk   0x8000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_EPMIS_Pos  17UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_EPMIS_Msk  0x20000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_IEPINT_Pos 18UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_IEPINT_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_OEPINT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_OEPINT_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_INCOMPISOIN_Pos 20UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_INCOMPISOIN_Msk 0x100000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_INCOMPLP_Pos 21UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_INCOMPLP_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_FETSUSP_Pos 22UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_FETSUSP_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_RESETDET_Pos 23UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_RESETDET_Msk 0x800000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_PRTINT_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_PRTINT_Msk 0x1000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_HCHINT_Pos 25UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_HCHINT_Msk 0x2000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_PTXFEMP_Pos 26UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_PTXFEMP_Msk 0x4000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_LPM_INT_Pos 27UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_LPM_INT_Msk 0x8000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_CONIDSTSCHNG_Pos 28UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_CONIDSTSCHNG_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_DISCONNINT_Pos 29UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_DISCONNINT_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_SESSREQINT_Pos 30UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_SESSREQINT_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_WKUPINT_Pos 31UL
#define USBHS_DWC_OTG_INTREG_GINTSTS_WKUPINT_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.GINTMSK */
#define USBHS_DWC_OTG_INTREG_GINTMSK_MODEMISMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_MODEMISMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_OTGINTMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_OTGINTMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_SOFMSK_Pos 3UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_SOFMSK_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_RXFLVLMSK_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_RXFLVLMSK_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_NPTXFEMPMSK_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_NPTXFEMPMSK_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_GINNAKEFFMSK_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_GINNAKEFFMSK_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_GOUTNAKEFFMSK_Pos 7UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_GOUTNAKEFFMSK_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_ERLYSUSPMSK_Pos 10UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_ERLYSUSPMSK_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_USBSUSPMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_USBSUSPMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_USBRSTMSK_Pos 12UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_USBRSTMSK_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_ENUMDONEMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_ENUMDONEMSK_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_ISOOUTDROPMSK_Pos 14UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_ISOOUTDROPMSK_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_EOPFMSK_Pos 15UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_EOPFMSK_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_EPMISMSK_Pos 17UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_EPMISMSK_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_IEPINTMSK_Pos 18UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_IEPINTMSK_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_OEPINTMSK_Pos 19UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_OEPINTMSK_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_INCOMPLPMSK_Pos 21UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_INCOMPLPMSK_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_FETSUSPMSK_Pos 22UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_FETSUSPMSK_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_RESETDETMSK_Pos 23UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_RESETDETMSK_Msk 0x800000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_PRTINTMSK_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_PRTINTMSK_Msk 0x1000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_HCHINTMSK_Pos 25UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_HCHINTMSK_Msk 0x2000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_PTXFEMPMSK_Pos 26UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_PTXFEMPMSK_Msk 0x4000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_LPM_INTMSK_Pos 27UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_LPM_INTMSK_Msk 0x8000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_CONIDSTSCHNGMSK_Pos 28UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_CONIDSTSCHNGMSK_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_DISCONNINTMSK_Pos 29UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_DISCONNINTMSK_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_SESSREQINTMSK_Pos 30UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_SESSREQINTMSK_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_WKUPINTMSK_Pos 31UL
#define USBHS_DWC_OTG_INTREG_GINTMSK_WKUPINTMSK_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.GRXSTSR */
#define USBHS_DWC_OTG_INTREG_GRXSTSR_CHNUM_Pos  0UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_CHNUM_Msk  0xFUL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_BCNT_Pos   4UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_BCNT_Msk   0x7FF0UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_DPID_Pos   15UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_DPID_Msk   0x18000UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_PKTSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_PKTSTS_Msk 0x1E0000UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_FN_Pos     21UL
#define USBHS_DWC_OTG_INTREG_GRXSTSR_FN_Msk     0x1E00000UL
/* USBHS_DWC_OTG_INTREG.GRXSTSP */
#define USBHS_DWC_OTG_INTREG_GRXSTSP_CHNUM_Pos  0UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_CHNUM_Msk  0xFUL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_BCNT_Pos   4UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_BCNT_Msk   0x7FF0UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_DPID_Pos   15UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_DPID_Msk   0x18000UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_PKTSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_PKTSTS_Msk 0x1E0000UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_FN_Pos     21UL
#define USBHS_DWC_OTG_INTREG_GRXSTSP_FN_Msk     0x1E00000UL
/* USBHS_DWC_OTG_INTREG.GRXFSIZ */
#define USBHS_DWC_OTG_INTREG_GRXFSIZ_RXFDEP_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GRXFSIZ_RXFDEP_Msk 0x3FFUL
/* USBHS_DWC_OTG_INTREG.GNPTXFSIZ */
#define USBHS_DWC_OTG_INTREG_GNPTXFSIZ_NPTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GNPTXFSIZ_NPTXFSTADDR_Msk 0x3FFUL
#define USBHS_DWC_OTG_INTREG_GNPTXFSIZ_NPTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GNPTXFSIZ_NPTXFDEP_Msk 0x1FF0000UL
/* USBHS_DWC_OTG_INTREG.GNPTXSTS */
#define USBHS_DWC_OTG_INTREG_GNPTXSTS_NPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GNPTXSTS_NPTXFSPCAVAIL_Msk 0xFFFFUL
#define USBHS_DWC_OTG_INTREG_GNPTXSTS_NPTXQSPCAVAIL_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GNPTXSTS_NPTXQSPCAVAIL_Msk 0xFF0000UL
#define USBHS_DWC_OTG_INTREG_GNPTXSTS_NPTXQTOP_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GNPTXSTS_NPTXQTOP_Msk 0x7F000000UL
/* USBHS_DWC_OTG_INTREG.GGPIO */
#define USBHS_DWC_OTG_INTREG_GGPIO_GPI_Pos      0UL
#define USBHS_DWC_OTG_INTREG_GGPIO_GPI_Msk      0xFFFFUL
#define USBHS_DWC_OTG_INTREG_GGPIO_GPO_Pos      16UL
#define USBHS_DWC_OTG_INTREG_GGPIO_GPO_Msk      0xFFFF0000UL
/* USBHS_DWC_OTG_INTREG.GUID */
#define USBHS_DWC_OTG_INTREG_GUID_GUID_Pos      0UL
#define USBHS_DWC_OTG_INTREG_GUID_GUID_Msk      0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.GSNPSID */
#define USBHS_DWC_OTG_INTREG_GSNPSID_SYNOPSYSID_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GSNPSID_SYNOPSYSID_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.GHWCFG1 */
#define USBHS_DWC_OTG_INTREG_GHWCFG1_EPDIR_Pos  0UL
#define USBHS_DWC_OTG_INTREG_GHWCFG1_EPDIR_Msk  0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.GHWCFG2 */
#define USBHS_DWC_OTG_INTREG_GHWCFG2_OTGMODE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_OTGMODE_Msk 0x7UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_OTGARCH_Pos 3UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_OTGARCH_Msk 0x18UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_SINGPNT_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_SINGPNT_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_HSPHYTYPE_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_HSPHYTYPE_Msk 0xC0UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_FSPHYTYPE_Pos 8UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_FSPHYTYPE_Msk 0x300UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_NUMDEVEPS_Pos 10UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_NUMDEVEPS_Msk 0x3C00UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_NUMHSTCHNL_Pos 14UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_NUMHSTCHNL_Msk 0x3C000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_PERIOSUPPORT_Pos 18UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_PERIOSUPPORT_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_DYNFIFOSIZING_Pos 19UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_DYNFIFOSIZING_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_MULTIPROCINTRPT_Pos 20UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_MULTIPROCINTRPT_Msk 0x100000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_NPTXQDEPTH_Pos 22UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_NPTXQDEPTH_Msk 0xC00000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_PTXQDEPTH_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_PTXQDEPTH_Msk 0x3000000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_TKNQDEPTH_Pos 26UL
#define USBHS_DWC_OTG_INTREG_GHWCFG2_TKNQDEPTH_Msk 0x7C000000UL
/* USBHS_DWC_OTG_INTREG.GHWCFG3 */
#define USBHS_DWC_OTG_INTREG_GHWCFG3_XFERSIZEWIDTH_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_XFERSIZEWIDTH_Msk 0xFUL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_PKTSIZEWIDTH_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_PKTSIZEWIDTH_Msk 0x70UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_OTGEN_Pos  7UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_OTGEN_Msk  0x80UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_I2CINTSEL_Pos 8UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_I2CINTSEL_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_VNDCTLSUPT_Pos 9UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_VNDCTLSUPT_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_OPTFEATURE_Pos 10UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_OPTFEATURE_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_RSTTYPE_Pos 11UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_RSTTYPE_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_ADPSUPPORT_Pos 12UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_ADPSUPPORT_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_HSICMODE_Pos 13UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_HSICMODE_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_BCSUPPORT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_BCSUPPORT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_LPMMODE_Pos 15UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_LPMMODE_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_DFIFODEPTH_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GHWCFG3_DFIFODEPTH_Msk 0xFFFF0000UL
/* USBHS_DWC_OTG_INTREG.GHWCFG4 */
#define USBHS_DWC_OTG_INTREG_GHWCFG4_NUMDEVPERIOEPS_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_NUMDEVPERIOEPS_Msk 0xFUL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_PARTIALPWRDN_Pos 4UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_PARTIALPWRDN_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_AHBFREQ_Pos 5UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_AHBFREQ_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_HIBERNATION_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_HIBERNATION_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_EXTENDEDHIBERNATION_Pos 7UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_EXTENDEDHIBERNATION_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_ENHANCEDLPMSUPT1_Pos 9UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_ENHANCEDLPMSUPT1_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_SERVINTFLOW_Pos 10UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_SERVINTFLOW_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_IPGISOCSUPT_Pos 11UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_IPGISOCSUPT_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_ACGSUPT_Pos 12UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_ACGSUPT_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_ENHANCEDLPMSUPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_ENHANCEDLPMSUPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_PHYDATAWIDTH_Pos 14UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_PHYDATAWIDTH_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_NUMCTLEPS_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_NUMCTLEPS_Msk 0xF0000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_IDDGFLTR_Pos 20UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_IDDGFLTR_Msk 0x100000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_VBUSVALIDFLTR_Pos 21UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_VBUSVALIDFLTR_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_AVALIDFLTR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_AVALIDFLTR_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_BVALIDFLTR_Pos 23UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_BVALIDFLTR_Msk 0x800000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_SESSENDFLTR_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_SESSENDFLTR_Msk 0x1000000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_DEDFIFOMODE_Pos 25UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_DEDFIFOMODE_Msk 0x2000000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_INEPS_Pos  26UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_INEPS_Msk  0x3C000000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_DESCDMAENABLED_Pos 30UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_DESCDMAENABLED_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_DESCDMA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_GHWCFG4_DESCDMA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.GLPMCFG */
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPMCAP_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPMCAP_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_APPL1RES_Pos 1UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_APPL1RES_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_HIRD_Pos   2UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_HIRD_Msk   0x3CUL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_BREMOTEWAKE_Pos 6UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_BREMOTEWAKE_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_ENBLSLPM_Pos 7UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_ENBLSLPM_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_HIRD_THRES_Pos 8UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_HIRD_THRES_Msk 0x1F00UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_COREL1RES_Pos 13UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_COREL1RES_Msk 0x6000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_SLPSTS_Pos 15UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_SLPSTS_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_L1RESUMEOK_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_L1RESUMEOK_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_CHNL_INDX_Pos 17UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_CHNL_INDX_Msk 0x1E0000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_RETRY_CNT_Pos 21UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_RETRY_CNT_Msk 0xE00000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_SNDLPM_Pos 24UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_SNDLPM_Msk 0x1000000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_RETRYCNT_STS_Pos 25UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_RETRYCNT_STS_Msk 0xE000000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_ENBESL_Pos 28UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_ENBESL_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_RESTORESLPSTS_Pos 29UL
#define USBHS_DWC_OTG_INTREG_GLPMCFG_LPM_RESTORESLPSTS_Msk 0x20000000UL
/* USBHS_DWC_OTG_INTREG.GDFIFOCFG */
#define USBHS_DWC_OTG_INTREG_GDFIFOCFG_GDFIFOCFG_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GDFIFOCFG_GDFIFOCFG_Msk 0xFFFFUL
#define USBHS_DWC_OTG_INTREG_GDFIFOCFG_EPINFOBASEADDR_Pos 16UL
#define USBHS_DWC_OTG_INTREG_GDFIFOCFG_EPINFOBASEADDR_Msk 0xFFFF0000UL
/* USBHS_DWC_OTG_INTREG.GINTMSK2 */
#define USBHS_DWC_OTG_INTREG_GINTMSK2_GINTMSK2_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GINTMSK2_GINTMSK2_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.GINTSTS2 */
#define USBHS_DWC_OTG_INTREG_GINTSTS2_GINTSTS2_Pos 0UL
#define USBHS_DWC_OTG_INTREG_GINTSTS2_GINTSTS2_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HPTXFSIZ */
#define USBHS_DWC_OTG_INTREG_HPTXFSIZ_PTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HPTXFSIZ_PTXFSTADDR_Msk 0x3FFUL
#define USBHS_DWC_OTG_INTREG_HPTXFSIZ_PTXFSIZE_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HPTXFSIZ_PTXFSIZE_Msk 0x7FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF1 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF1_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF1_INEPNTXFSTADDR_Msk 0x3FFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF1_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF1_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF2 */
