PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_DIEPTXF2_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF2_INEPNTXFSTADDR_Msk 0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF2_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF2_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF3 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF3_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF3_INEPNTXFSTADDR_Msk 0xFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF3_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF3_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF4 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF4_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF4_INEPNTXFSTADDR_Msk 0xFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF4_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF4_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF5 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF5_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF5_INEPNTXFSTADDR_Msk 0xFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF5_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF5_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF6 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF6_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF6_INEPNTXFSTADDR_Msk 0x1FFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF6_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF6_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF7 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF7_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF7_INEPNTXFSTADDR_Msk 0x1FFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF7_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF7_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.DIEPTXF8 */
#define USBHS_DWC_OTG_INTREG_DIEPTXF8_INEPNTXFSTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF8_INEPNTXFSTADDR_Msk 0x1FFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTXF8_INEPNTXFDEP_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DIEPTXF8_INEPNTXFDEP_Msk 0x3FF0000UL
/* USBHS_DWC_OTG_INTREG.HCFG */
#define USBHS_DWC_OTG_INTREG_HCFG_FSLSPCLKSEL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCFG_FSLSPCLKSEL_Msk 0x3UL
#define USBHS_DWC_OTG_INTREG_HCFG_FSLSSUPP_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCFG_FSLSSUPP_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCFG_ENA32KHZS_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCFG_ENA32KHZS_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCFG_RESVALID_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCFG_RESVALID_Msk  0xFF00UL
#define USBHS_DWC_OTG_INTREG_HCFG_DIS_TX_IPGAP_DLY_CHECK_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCFG_DIS_TX_IPGAP_DLY_CHECK_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCFG_DESCDMA_Pos   23UL
#define USBHS_DWC_OTG_INTREG_HCFG_DESCDMA_Msk   0x800000UL
#define USBHS_DWC_OTG_INTREG_HCFG_FRLISTEN_Pos  24UL
#define USBHS_DWC_OTG_INTREG_HCFG_FRLISTEN_Msk  0x3000000UL
#define USBHS_DWC_OTG_INTREG_HCFG_PERSCHEDENA_Pos 26UL
#define USBHS_DWC_OTG_INTREG_HCFG_PERSCHEDENA_Msk 0x4000000UL
#define USBHS_DWC_OTG_INTREG_HCFG_MODECHTIMEN_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCFG_MODECHTIMEN_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HFIR */
#define USBHS_DWC_OTG_INTREG_HFIR_FRINT_Pos     0UL
#define USBHS_DWC_OTG_INTREG_HFIR_FRINT_Msk     0xFFFFUL
#define USBHS_DWC_OTG_INTREG_HFIR_HFIRRLDCTRL_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HFIR_HFIRRLDCTRL_Msk 0x10000UL
/* USBHS_DWC_OTG_INTREG.HFNUM */
#define USBHS_DWC_OTG_INTREG_HFNUM_FRNUM_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HFNUM_FRNUM_Msk    0xFFFFUL
#define USBHS_DWC_OTG_INTREG_HFNUM_FRREM_Pos    16UL
#define USBHS_DWC_OTG_INTREG_HFNUM_FRREM_Msk    0xFFFF0000UL
/* USBHS_DWC_OTG_INTREG.HPTXSTS */
#define USBHS_DWC_OTG_INTREG_HPTXSTS_PTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HPTXSTS_PTXFSPCAVAIL_Msk 0xFFFFUL
#define USBHS_DWC_OTG_INTREG_HPTXSTS_PTXQSPCAVAIL_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HPTXSTS_PTXQSPCAVAIL_Msk 0x7F0000UL
#define USBHS_DWC_OTG_INTREG_HPTXSTS_PTXQTOP_Pos 23UL
#define USBHS_DWC_OTG_INTREG_HPTXSTS_PTXQTOP_Msk 0xFF800000UL
/* USBHS_DWC_OTG_INTREG.HAINT */
#define USBHS_DWC_OTG_INTREG_HAINT_HAINT_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HAINT_HAINT_Msk    0xFFFFUL
/* USBHS_DWC_OTG_INTREG.HAINTMSK */
#define USBHS_DWC_OTG_INTREG_HAINTMSK_HAINTMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HAINTMSK_HAINTMSK_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.HFLBADDR */
#define USBHS_DWC_OTG_INTREG_HFLBADDR_HFLBADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HFLBADDR_HFLBADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HPRT */
#define USBHS_DWC_OTG_INTREG_HPRT_PRTCONNSTS_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTCONNSTS_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTCONNDET_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTCONNDET_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTENA_Pos    2UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTENA_Msk    0x4UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTENCHNG_Pos 3UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTENCHNG_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTOVRCURRACT_Pos 4UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTOVRCURRACT_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTOVRCURRCHNG_Pos 5UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTOVRCURRCHNG_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTRES_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTRES_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTSUSP_Pos   7UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTSUSP_Msk   0x80UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTRST_Pos    8UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTRST_Msk    0x100UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTLNSTS_Pos  10UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTLNSTS_Msk  0xC00UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTPWR_Pos    12UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTPWR_Msk    0x1000UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTTSTCTL_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTTSTCTL_Msk 0x1E000UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTSPD_Pos    17UL
#define USBHS_DWC_OTG_INTREG_HPRT_PRTSPD_Msk    0x60000UL
/* USBHS_DWC_OTG_INTREG.HCCHAR0 */
#define USBHS_DWC_OTG_INTREG_HCCHAR0_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR0_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT0 */
#define USBHS_DWC_OTG_INTREG_HCSPLT0_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT0_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT0 */
#define USBHS_DWC_OTG_INTREG_HCINT0_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT0_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT0_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT0_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT0_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT0_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT0_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT0_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT0_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT0_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT0_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT0_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT0_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT0_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT0_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT0_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT0_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT0_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT0_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT0_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT0_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT0_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT0_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT0_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT0_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT0_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT0_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT0_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK0 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK0_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ0 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ0_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA0 */
#define USBHS_DWC_OTG_INTREG_HCDMA0_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA0_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB0 */
#define USBHS_DWC_OTG_INTREG_HCDMAB0_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB0_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR1 */
#define USBHS_DWC_OTG_INTREG_HCCHAR1_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR1_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT1 */
#define USBHS_DWC_OTG_INTREG_HCSPLT1_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT1_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT1 */
#define USBHS_DWC_OTG_INTREG_HCINT1_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT1_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT1_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT1_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT1_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT1_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT1_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT1_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT1_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT1_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT1_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT1_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT1_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT1_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT1_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT1_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT1_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT1_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT1_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT1_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT1_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT1_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT1_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT1_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT1_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT1_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT1_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT1_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK1 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK1_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ1 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ1_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA1 */
#define USBHS_DWC_OTG_INTREG_HCDMA1_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA1_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB1 */
#define USBHS_DWC_OTG_INTREG_HCDMAB1_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB1_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR2 */
#define USBHS_DWC_OTG_INTREG_HCCHAR2_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR2_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT2 */
#define USBHS_DWC_OTG_INTREG_HCSPLT2_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT2_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT2 */
#define USBHS_DWC_OTG_INTREG_HCINT2_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT2_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT2_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT2_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT2_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT2_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT2_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT2_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT2_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT2_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT2_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT2_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT2_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT2_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT2_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT2_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT2_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT2_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT2_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT2_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT2_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT2_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT2_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT2_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT2_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT2_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT2_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT2_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK2 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK2_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ2 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ2_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA2 */
#define USBHS_DWC_OTG_INTREG_HCDMA2_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA2_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB2 */
#define USBHS_DWC_OTG_INTREG_HCDMAB2_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB2_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR3 */
#define USBHS_DWC_OTG_INTREG_HCCHAR3_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR3_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT3 */
#define USBHS_DWC_OTG_INTREG_HCSPLT3_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT3_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT3 */
#define USBHS_DWC_OTG_INTREG_HCINT3_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT3_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT3_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT3_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT3_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT3_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT3_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT3_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT3_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT3_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT3_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT3_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT3_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT3_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT3_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT3_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT3_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT3_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT3_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT3_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT3_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT3_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT3_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT3_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT3_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT3_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT3_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT3_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK3 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_BNAINTRMSK_Pos 11UL
