PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK3_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ3 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ3_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA3 */
#define USBHS_DWC_OTG_INTREG_HCDMA3_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA3_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB3 */
#define USBHS_DWC_OTG_INTREG_HCDMAB3_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB3_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR4 */
#define USBHS_DWC_OTG_INTREG_HCCHAR4_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR4_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT4 */
#define USBHS_DWC_OTG_INTREG_HCSPLT4_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT4_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT4 */
#define USBHS_DWC_OTG_INTREG_HCINT4_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT4_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT4_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT4_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT4_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT4_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT4_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT4_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT4_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT4_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT4_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT4_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT4_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT4_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT4_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT4_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT4_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT4_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT4_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT4_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT4_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT4_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT4_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT4_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT4_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT4_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT4_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT4_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK4 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK4_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ4 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ4_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA4 */
#define USBHS_DWC_OTG_INTREG_HCDMA4_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA4_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB4 */
#define USBHS_DWC_OTG_INTREG_HCDMAB4_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB4_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR5 */
#define USBHS_DWC_OTG_INTREG_HCCHAR5_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR5_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT5 */
#define USBHS_DWC_OTG_INTREG_HCSPLT5_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT5_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT5 */
#define USBHS_DWC_OTG_INTREG_HCINT5_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT5_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT5_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT5_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT5_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT5_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT5_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT5_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT5_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT5_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT5_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT5_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT5_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT5_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT5_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT5_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT5_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT5_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT5_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT5_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT5_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT5_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT5_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT5_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT5_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT5_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT5_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT5_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK5 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK5_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ5 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ5_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA5 */
#define USBHS_DWC_OTG_INTREG_HCDMA5_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA5_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB5 */
#define USBHS_DWC_OTG_INTREG_HCDMAB5_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB5_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR6 */
#define USBHS_DWC_OTG_INTREG_HCCHAR6_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR6_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT6 */
#define USBHS_DWC_OTG_INTREG_HCSPLT6_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT6_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT6 */
#define USBHS_DWC_OTG_INTREG_HCINT6_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT6_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT6_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT6_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT6_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT6_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT6_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT6_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT6_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT6_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT6_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT6_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT6_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT6_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT6_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT6_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT6_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT6_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT6_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT6_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT6_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT6_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT6_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT6_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT6_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT6_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT6_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT6_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK6 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK6_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ6 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ6_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA6 */
#define USBHS_DWC_OTG_INTREG_HCDMA6_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA6_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB6 */
#define USBHS_DWC_OTG_INTREG_HCDMAB6_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB6_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR7 */
#define USBHS_DWC_OTG_INTREG_HCCHAR7_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR7_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT7 */
#define USBHS_DWC_OTG_INTREG_HCSPLT7_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT7_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT7 */
#define USBHS_DWC_OTG_INTREG_HCINT7_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT7_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT7_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT7_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT7_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT7_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT7_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT7_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT7_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT7_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT7_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT7_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT7_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT7_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT7_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT7_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT7_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT7_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT7_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT7_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT7_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT7_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT7_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT7_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT7_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT7_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT7_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT7_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK7 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK7_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ7 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ7_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA7 */
#define USBHS_DWC_OTG_INTREG_HCDMA7_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA7_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB7 */
#define USBHS_DWC_OTG_INTREG_HCDMAB7_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB7_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR8 */
#define USBHS_DWC_OTG_INTREG_HCCHAR8_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR8_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT8 */
#define USBHS_DWC_OTG_INTREG_HCSPLT8_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT8_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT8 */
#define USBHS_DWC_OTG_INTREG_HCINT8_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT8_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT8_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT8_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT8_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT8_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT8_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT8_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT8_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT8_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT8_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT8_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT8_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT8_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT8_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT8_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT8_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT8_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT8_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT8_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT8_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT8_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT8_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT8_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT8_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT8_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT8_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT8_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK8 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_BNAINTRMSK_Msk 0x800UL
