PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK8_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ8 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ8_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA8 */
#define USBHS_DWC_OTG_INTREG_HCDMA8_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA8_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB8 */
#define USBHS_DWC_OTG_INTREG_HCDMAB8_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB8_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR9 */
#define USBHS_DWC_OTG_INTREG_HCCHAR9_MPS_Pos    0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_MPS_Msk    0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EPNUM_Pos  11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EPNUM_Msk  0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EPDIR_Pos  15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EPDIR_Msk  0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EC_Pos     20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_EC_Msk     0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_CHDIS_Pos  30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_CHDIS_Msk  0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_CHENA_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR9_CHENA_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT9 */
#define USBHS_DWC_OTG_INTREG_HCSPLT9_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT9_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT9 */
#define USBHS_DWC_OTG_INTREG_HCINT9_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT9_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT9_CHHLTD_Pos  1UL
#define USBHS_DWC_OTG_INTREG_HCINT9_CHHLTD_Msk  0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT9_AHBERR_Pos  2UL
#define USBHS_DWC_OTG_INTREG_HCINT9_AHBERR_Msk  0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT9_STALL_Pos   3UL
#define USBHS_DWC_OTG_INTREG_HCINT9_STALL_Msk   0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT9_NAK_Pos     4UL
#define USBHS_DWC_OTG_INTREG_HCINT9_NAK_Msk     0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT9_ACK_Pos     5UL
#define USBHS_DWC_OTG_INTREG_HCINT9_ACK_Msk     0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT9_NYET_Pos    6UL
#define USBHS_DWC_OTG_INTREG_HCINT9_NYET_Msk    0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT9_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT9_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT9_BBLERR_Pos  8UL
#define USBHS_DWC_OTG_INTREG_HCINT9_BBLERR_Msk  0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT9_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT9_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT9_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT9_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT9_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT9_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT9_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT9_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT9_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT9_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK9 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK9_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ9 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_PID_Pos    29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_PID_Msk    0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_DOPNG_Pos  31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ9_DOPNG_Msk  0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA9 */
#define USBHS_DWC_OTG_INTREG_HCDMA9_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA9_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB9 */
#define USBHS_DWC_OTG_INTREG_HCDMAB9_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB9_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR10 */
#define USBHS_DWC_OTG_INTREG_HCCHAR10_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EPNUM_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EPNUM_Msk 0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EPDIR_Pos 15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EPDIR_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EC_Pos    20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_EC_Msk    0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_CHDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_CHDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_CHENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR10_CHENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT10 */
#define USBHS_DWC_OTG_INTREG_HCSPLT10_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT10_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT10 */
#define USBHS_DWC_OTG_INTREG_HCINT10_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT10_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT10_CHHLTD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINT10_CHHLTD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT10_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINT10_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT10_STALL_Pos  3UL
#define USBHS_DWC_OTG_INTREG_HCINT10_STALL_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT10_NAK_Pos    4UL
#define USBHS_DWC_OTG_INTREG_HCINT10_NAK_Msk    0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT10_ACK_Pos    5UL
#define USBHS_DWC_OTG_INTREG_HCINT10_ACK_Msk    0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT10_NYET_Pos   6UL
#define USBHS_DWC_OTG_INTREG_HCINT10_NYET_Msk   0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT10_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT10_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT10_BBLERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_HCINT10_BBLERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT10_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT10_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT10_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT10_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT10_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT10_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT10_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT10_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT10_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT10_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK10 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK10_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ10 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_PID_Pos   29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_PID_Msk   0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_DOPNG_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ10_DOPNG_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA10 */
#define USBHS_DWC_OTG_INTREG_HCDMA10_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA10_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB10 */
#define USBHS_DWC_OTG_INTREG_HCDMAB10_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB10_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR11 */
#define USBHS_DWC_OTG_INTREG_HCCHAR11_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EPNUM_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EPNUM_Msk 0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EPDIR_Pos 15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EPDIR_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EC_Pos    20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_EC_Msk    0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_CHDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_CHDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_CHENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR11_CHENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT11 */
#define USBHS_DWC_OTG_INTREG_HCSPLT11_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT11_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT11 */
#define USBHS_DWC_OTG_INTREG_HCINT11_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT11_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT11_CHHLTD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINT11_CHHLTD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT11_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINT11_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT11_STALL_Pos  3UL
#define USBHS_DWC_OTG_INTREG_HCINT11_STALL_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT11_NAK_Pos    4UL
#define USBHS_DWC_OTG_INTREG_HCINT11_NAK_Msk    0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT11_ACK_Pos    5UL
#define USBHS_DWC_OTG_INTREG_HCINT11_ACK_Msk    0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT11_NYET_Pos   6UL
#define USBHS_DWC_OTG_INTREG_HCINT11_NYET_Msk   0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT11_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT11_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT11_BBLERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_HCINT11_BBLERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT11_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT11_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT11_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT11_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT11_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT11_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT11_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT11_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT11_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT11_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK11 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK11_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ11 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_PID_Pos   29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_PID_Msk   0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_DOPNG_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ11_DOPNG_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA11 */
#define USBHS_DWC_OTG_INTREG_HCDMA11_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA11_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB11 */
#define USBHS_DWC_OTG_INTREG_HCDMAB11_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB11_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR12 */
#define USBHS_DWC_OTG_INTREG_HCCHAR12_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EPNUM_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EPNUM_Msk 0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EPDIR_Pos 15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EPDIR_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EC_Pos    20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_EC_Msk    0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_CHDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_CHDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_CHENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR12_CHENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT12 */
#define USBHS_DWC_OTG_INTREG_HCSPLT12_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT12_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT12 */
#define USBHS_DWC_OTG_INTREG_HCINT12_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT12_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT12_CHHLTD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINT12_CHHLTD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT12_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINT12_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT12_STALL_Pos  3UL
#define USBHS_DWC_OTG_INTREG_HCINT12_STALL_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT12_NAK_Pos    4UL
#define USBHS_DWC_OTG_INTREG_HCINT12_NAK_Msk    0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT12_ACK_Pos    5UL
#define USBHS_DWC_OTG_INTREG_HCINT12_ACK_Msk    0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT12_NYET_Pos   6UL
#define USBHS_DWC_OTG_INTREG_HCINT12_NYET_Msk   0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT12_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT12_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT12_BBLERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_HCINT12_BBLERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT12_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT12_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT12_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT12_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT12_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT12_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT12_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT12_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT12_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT12_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK12 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK12_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ12 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_PID_Pos   29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_PID_Msk   0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_DOPNG_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ12_DOPNG_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA12 */
#define USBHS_DWC_OTG_INTREG_HCDMA12_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA12_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB12 */
#define USBHS_DWC_OTG_INTREG_HCDMAB12_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB12_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR13 */
#define USBHS_DWC_OTG_INTREG_HCCHAR13_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EPNUM_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EPNUM_Msk 0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EPDIR_Pos 15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EPDIR_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EC_Pos    20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_EC_Msk    0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_CHDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_CHDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_CHENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR13_CHENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT13 */
#define USBHS_DWC_OTG_INTREG_HCSPLT13_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT13_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT13 */
#define USBHS_DWC_OTG_INTREG_HCINT13_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT13_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT13_CHHLTD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINT13_CHHLTD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT13_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINT13_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT13_STALL_Pos  3UL
#define USBHS_DWC_OTG_INTREG_HCINT13_STALL_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT13_NAK_Pos    4UL
#define USBHS_DWC_OTG_INTREG_HCINT13_NAK_Msk    0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT13_ACK_Pos    5UL
#define USBHS_DWC_OTG_INTREG_HCINT13_ACK_Msk    0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT13_NYET_Pos   6UL
#define USBHS_DWC_OTG_INTREG_HCINT13_NYET_Msk   0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT13_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT13_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT13_BBLERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_HCINT13_BBLERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT13_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT13_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT13_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT13_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT13_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT13_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT13_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT13_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT13_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT13_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK13 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_AHBERRMSK_Msk 0x4UL
