PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK13_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ13 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_PID_Pos   29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_PID_Msk   0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_DOPNG_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ13_DOPNG_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA13 */
#define USBHS_DWC_OTG_INTREG_HCDMA13_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA13_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB13 */
#define USBHS_DWC_OTG_INTREG_HCDMAB13_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB13_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR14 */
#define USBHS_DWC_OTG_INTREG_HCCHAR14_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EPNUM_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EPNUM_Msk 0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EPDIR_Pos 15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EPDIR_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EC_Pos    20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_EC_Msk    0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_CHDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_CHDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_CHENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR14_CHENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT14 */
#define USBHS_DWC_OTG_INTREG_HCSPLT14_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT14_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT14 */
#define USBHS_DWC_OTG_INTREG_HCINT14_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT14_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT14_CHHLTD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINT14_CHHLTD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT14_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINT14_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT14_STALL_Pos  3UL
#define USBHS_DWC_OTG_INTREG_HCINT14_STALL_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT14_NAK_Pos    4UL
#define USBHS_DWC_OTG_INTREG_HCINT14_NAK_Msk    0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT14_ACK_Pos    5UL
#define USBHS_DWC_OTG_INTREG_HCINT14_ACK_Msk    0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT14_NYET_Pos   6UL
#define USBHS_DWC_OTG_INTREG_HCINT14_NYET_Msk   0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT14_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT14_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT14_BBLERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_HCINT14_BBLERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT14_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT14_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT14_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT14_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT14_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT14_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT14_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT14_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT14_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT14_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK14 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK14_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ14 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_PID_Pos   29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_PID_Msk   0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_DOPNG_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ14_DOPNG_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA14 */
#define USBHS_DWC_OTG_INTREG_HCDMA14_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA14_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB14 */
#define USBHS_DWC_OTG_INTREG_HCDMAB14_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB14_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCCHAR15 */
#define USBHS_DWC_OTG_INTREG_HCCHAR15_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EPNUM_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EPNUM_Msk 0x7800UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EPDIR_Pos 15UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EPDIR_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_LSPDDEV_Pos 17UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_LSPDDEV_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EC_Pos    20UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_EC_Msk    0x300000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_DEVADDR_Pos 22UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_DEVADDR_Msk 0x1FC00000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_ODDFRM_Pos 29UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_ODDFRM_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_CHDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_CHDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_CHENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCCHAR15_CHENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCSPLT15 */
#define USBHS_DWC_OTG_INTREG_HCSPLT15_PRTADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_PRTADDR_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_HUBADDR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_HUBADDR_Msk 0x3F80UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_XACTPOS_Pos 14UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_XACTPOS_Msk 0xC000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_COMPSPLT_Pos 16UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_COMPSPLT_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_SPLTENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCSPLT15_SPLTENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCINT15 */
#define USBHS_DWC_OTG_INTREG_HCINT15_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINT15_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINT15_CHHLTD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINT15_CHHLTD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINT15_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINT15_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINT15_STALL_Pos  3UL
#define USBHS_DWC_OTG_INTREG_HCINT15_STALL_Msk  0x8UL
#define USBHS_DWC_OTG_INTREG_HCINT15_NAK_Pos    4UL
#define USBHS_DWC_OTG_INTREG_HCINT15_NAK_Msk    0x10UL
#define USBHS_DWC_OTG_INTREG_HCINT15_ACK_Pos    5UL
#define USBHS_DWC_OTG_INTREG_HCINT15_ACK_Msk    0x20UL
#define USBHS_DWC_OTG_INTREG_HCINT15_NYET_Pos   6UL
#define USBHS_DWC_OTG_INTREG_HCINT15_NYET_Msk   0x40UL
#define USBHS_DWC_OTG_INTREG_HCINT15_XACTERR_Pos 7UL
#define USBHS_DWC_OTG_INTREG_HCINT15_XACTERR_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_HCINT15_BBLERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_HCINT15_BBLERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_HCINT15_FRMOVRUN_Pos 9UL
#define USBHS_DWC_OTG_INTREG_HCINT15_FRMOVRUN_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_HCINT15_DATATGLERR_Pos 10UL
#define USBHS_DWC_OTG_INTREG_HCINT15_DATATGLERR_Msk 0x400UL
#define USBHS_DWC_OTG_INTREG_HCINT15_BNAINTR_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINT15_BNAINTR_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINT15_XCS_XACT_ERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_HCINT15_XCS_XACT_ERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_HCINT15_DESC_LST_ROLLINTR_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINT15_DESC_LST_ROLLINTR_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCINTMSK15 */
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_CHHLTDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_CHHLTDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_BNAINTRMSK_Pos 11UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_BNAINTRMSK_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_DESC_LST_ROLLINTRMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_HCINTMSK15_DESC_LST_ROLLINTRMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.HCTSIZ15 */
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_PID_Pos   29UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_PID_Msk   0x60000000UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_DOPNG_Pos 31UL
#define USBHS_DWC_OTG_INTREG_HCTSIZ15_DOPNG_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.HCDMA15 */
#define USBHS_DWC_OTG_INTREG_HCDMA15_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMA15_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.HCDMAB15 */
#define USBHS_DWC_OTG_INTREG_HCDMAB15_HCDMAB_Pos 0UL
#define USBHS_DWC_OTG_INTREG_HCDMAB15_HCDMAB_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DCFG */
#define USBHS_DWC_OTG_INTREG_DCFG_DEVSPD_Pos    0UL
#define USBHS_DWC_OTG_INTREG_DCFG_DEVSPD_Msk    0x3UL
#define USBHS_DWC_OTG_INTREG_DCFG_NZSTSOUTHSHK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DCFG_NZSTSOUTHSHK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DCFG_ENA32KHZSUSP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DCFG_ENA32KHZSUSP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DCFG_DEVADDR_Pos   4UL
#define USBHS_DWC_OTG_INTREG_DCFG_DEVADDR_Msk   0x7F0UL
#define USBHS_DWC_OTG_INTREG_DCFG_PERFRINT_Pos  11UL
#define USBHS_DWC_OTG_INTREG_DCFG_PERFRINT_Msk  0x1800UL
#define USBHS_DWC_OTG_INTREG_DCFG_ENDEVOUTNAK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DCFG_ENDEVOUTNAK_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DCFG_XCVRDLY_Pos   14UL
#define USBHS_DWC_OTG_INTREG_DCFG_XCVRDLY_Msk   0x4000UL
#define USBHS_DWC_OTG_INTREG_DCFG_ERRATICINTMSK_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DCFG_ERRATICINTMSK_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DCFG_IPGISOCSUPT_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DCFG_IPGISOCSUPT_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DCFG_DESCDMA_Pos   23UL
#define USBHS_DWC_OTG_INTREG_DCFG_DESCDMA_Msk   0x800000UL
#define USBHS_DWC_OTG_INTREG_DCFG_PERSCHINTVL_Pos 24UL
#define USBHS_DWC_OTG_INTREG_DCFG_PERSCHINTVL_Msk 0x3000000UL
#define USBHS_DWC_OTG_INTREG_DCFG_RESVALID_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DCFG_RESVALID_Msk  0xFC000000UL
/* USBHS_DWC_OTG_INTREG.DCTL */
#define USBHS_DWC_OTG_INTREG_DCTL_RMTWKUPSIG_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DCTL_RMTWKUPSIG_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DCTL_SFTDISCON_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DCTL_SFTDISCON_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DCTL_GNPINNAKSTS_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DCTL_GNPINNAKSTS_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DCTL_GOUTNAKSTS_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DCTL_GOUTNAKSTS_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DCTL_TSTCTL_Pos    4UL
#define USBHS_DWC_OTG_INTREG_DCTL_TSTCTL_Msk    0x70UL
#define USBHS_DWC_OTG_INTREG_DCTL_SGNPINNAK_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DCTL_SGNPINNAK_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DCTL_CGNPINNAK_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DCTL_CGNPINNAK_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DCTL_SGOUTNAK_Pos  9UL
#define USBHS_DWC_OTG_INTREG_DCTL_SGOUTNAK_Msk  0x200UL
#define USBHS_DWC_OTG_INTREG_DCTL_CGOUTNAK_Pos  10UL
#define USBHS_DWC_OTG_INTREG_DCTL_CGOUTNAK_Msk  0x400UL
#define USBHS_DWC_OTG_INTREG_DCTL_PWRONPRGDONE_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DCTL_PWRONPRGDONE_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DCTL_GMC_Pos       13UL
#define USBHS_DWC_OTG_INTREG_DCTL_GMC_Msk       0x6000UL
#define USBHS_DWC_OTG_INTREG_DCTL_IGNRFRMNUM_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DCTL_IGNRFRMNUM_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DCTL_NAKONBBLE_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DCTL_NAKONBBLE_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_DCTL_ENCONTONBNA_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DCTL_ENCONTONBNA_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DCTL_DEEPSLEEPBESLREJECT_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DCTL_DEEPSLEEPBESLREJECT_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_DCTL_SERVINT_Pos   19UL
#define USBHS_DWC_OTG_INTREG_DCTL_SERVINT_Msk   0x80000UL
/* USBHS_DWC_OTG_INTREG.DSTS */
#define USBHS_DWC_OTG_INTREG_DSTS_SUSPSTS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DSTS_SUSPSTS_Msk   0x1UL
#define USBHS_DWC_OTG_INTREG_DSTS_ENUMSPD_Pos   1UL
#define USBHS_DWC_OTG_INTREG_DSTS_ENUMSPD_Msk   0x6UL
#define USBHS_DWC_OTG_INTREG_DSTS_ERRTICERR_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DSTS_ERRTICERR_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DSTS_SOFFN_Pos     8UL
#define USBHS_DWC_OTG_INTREG_DSTS_SOFFN_Msk     0x3FFF00UL
#define USBHS_DWC_OTG_INTREG_DSTS_DEVLNSTS_Pos  22UL
#define USBHS_DWC_OTG_INTREG_DSTS_DEVLNSTS_Msk  0xC00000UL
/* USBHS_DWC_OTG_INTREG.DIEPMSK */
#define USBHS_DWC_OTG_INTREG_DIEPMSK_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_EPDISBLDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_EPDISBLDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_TIMEOUTMSK_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_TIMEOUTMSK_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_INTKNTXFEMPMSK_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_INTKNTXFEMPMSK_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_INTKNEPMISMSK_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_INTKNEPMISMSK_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_INEPNAKEFFMSK_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_INEPNAKEFFMSK_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_TXFIFOUNDRNMSK_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_TXFIFOUNDRNMSK_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_BNAININTRMSK_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_BNAININTRMSK_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_NAKMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPMSK_NAKMSK_Msk 0x2000UL
/* USBHS_DWC_OTG_INTREG.DOEPMSK */
#define USBHS_DWC_OTG_INTREG_DOEPMSK_XFERCOMPLMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_XFERCOMPLMSK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_EPDISBLDMSK_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_EPDISBLDMSK_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_AHBERRMSK_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_AHBERRMSK_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_SETUPMSK_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_SETUPMSK_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_OUTTKNEPDISMSK_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_OUTTKNEPDISMSK_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_STSPHSERCVDMSK_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_STSPHSERCVDMSK_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_OUTPKTERRMSK_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_OUTPKTERRMSK_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_BNAOUTINTRMSK_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_BNAOUTINTRMSK_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_BBLEERRMSK_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_BBLEERRMSK_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_NAKMSK_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_NAKMSK_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_NYETMSK_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPMSK_NYETMSK_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DAINT */
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT0_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT0_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT1_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT1_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT2_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT2_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT3_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT3_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT4_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT4_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT5_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT5_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT6_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT6_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT7_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT7_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT8_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DAINT_INEPINT8_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT0_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT0_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT1_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT1_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT2_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT2_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT3_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT3_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT4_Pos 20UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT4_Msk 0x100000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT5_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT5_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT6_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT6_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT7_Pos 23UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT7_Msk 0x800000UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT8_Pos 24UL
#define USBHS_DWC_OTG_INTREG_DAINT_OUTEPINT8_Msk 0x1000000UL
/* USBHS_DWC_OTG_INTREG.DAINTMSK */
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK0_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK0_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK1_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK1_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK2_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK2_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK3_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK3_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK4_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK4_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK5_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK5_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK6_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK6_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK7_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK7_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK8_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_INEPMSK8_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK0_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK0_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK1_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK1_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK2_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK2_Msk 0x40000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK3_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK3_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK4_Pos 20UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK4_Msk 0x100000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK5_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK5_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK6_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK6_Msk 0x400000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK7_Pos 23UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK7_Msk 0x800000UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK8_Pos 24UL
#define USBHS_DWC_OTG_INTREG_DAINTMSK_OUTEPMSK8_Msk 0x1000000UL
/* USBHS_DWC_OTG_INTREG.DVBUSDIS */
#define USBHS_DWC_OTG_INTREG_DVBUSDIS_DVBUSDIS_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DVBUSDIS_DVBUSDIS_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DVBUSPULSE */
#define USBHS_DWC_OTG_INTREG_DVBUSPULSE_DVBUSPULSE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DVBUSPULSE_DVBUSPULSE_Msk 0xFFFUL
/* USBHS_DWC_OTG_INTREG.DTHRCTL */
#define USBHS_DWC_OTG_INTREG_DTHRCTL_NONISOTHREN_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_NONISOTHREN_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_ISOTHREN_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_ISOTHREN_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_TXTHRLEN_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_TXTHRLEN_Msk 0x7FCUL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_AHBTHRRATIO_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_AHBTHRRATIO_Msk 0x1800UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_RXTHREN_Pos 16UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_RXTHREN_Msk 0x10000UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_RXTHRLEN_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_RXTHRLEN_Msk 0x3FE0000UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_ARBPRKEN_Pos 27UL
#define USBHS_DWC_OTG_INTREG_DTHRCTL_ARBPRKEN_Msk 0x8000000UL
/* USBHS_DWC_OTG_INTREG.DIEPEMPMSK */
#define USBHS_DWC_OTG_INTREG_DIEPEMPMSK_INEPTXFEMPMSK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPEMPMSK_INEPTXFEMPMSK_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL0 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_MPS_Msk   0x3UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL0_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT0 */
#define USBHS_DWC_OTG_INTREG_DIEPINT0_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_EPDISBLD_Pos 1UL
