PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_DIEPINT0_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT0_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ0 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ0_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ0_XFERSIZE_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ0_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ0_PKTCNT_Msk 0x180000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA0 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA0_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA0_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS0 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS0_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS0_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB0 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB0_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB0_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL1 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL1_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT1 */
#define USBHS_DWC_OTG_INTREG_DIEPINT1_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT1_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ1 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ1_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ1_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ1_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ1_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ1_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ1_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA1 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA1_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA1_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS1 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS1_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS1_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB1 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB1_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB1_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL2 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL2_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT2 */
#define USBHS_DWC_OTG_INTREG_DIEPINT2_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT2_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ2 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ2_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ2_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ2_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ2_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ2_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ2_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA2 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA2_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA2_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS2 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS2_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS2_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB2 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB2_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB2_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL3 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL3_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT3 */
#define USBHS_DWC_OTG_INTREG_DIEPINT3_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT3_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ3 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ3_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ3_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ3_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ3_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ3_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ3_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA3 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA3_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA3_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS3 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS3_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS3_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB3 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB3_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB3_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL4 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL4_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT4 */
#define USBHS_DWC_OTG_INTREG_DIEPINT4_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT4_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ4 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ4_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ4_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ4_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ4_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ4_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ4_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA4 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA4_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA4_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS4 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS4_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS4_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB4 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB4_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB4_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL5 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL5_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT5 */
#define USBHS_DWC_OTG_INTREG_DIEPINT5_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT5_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ5 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ5_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ5_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ5_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ5_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ5_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ5_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA5 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA5_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA5_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS5 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS5_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS5_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB5 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB5_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB5_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL6 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL6_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT6 */
#define USBHS_DWC_OTG_INTREG_DIEPINT6_XFERCOMPL_Pos 0UL
