PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_DIEPINT6_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT6_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ6 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ6_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ6_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ6_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ6_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ6_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ6_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA6 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA6_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA6_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS6 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS6_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS6_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB6 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB6_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB6_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL7 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL7_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT7 */
#define USBHS_DWC_OTG_INTREG_DIEPINT7_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT7_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ7 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ7_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ7_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ7_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ7_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ7_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ7_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA7 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA7_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA7_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS7 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS7_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS7_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB7 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB7_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB7_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPCTL8 */
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_TXFNUM_Pos 22UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_TXFNUM_Msk 0x3C00000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DIEPCTL8_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DIEPINT8 */
#define USBHS_DWC_OTG_INTREG_DIEPINT8_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_TIMEOUT_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_TIMEOUT_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_INTKNTXFEMP_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_INTKNTXFEMP_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_INTKNEPMIS_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_INTKNEPMIS_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_INEPNAKEFF_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_INEPNAKEFF_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_TXFEMP_Pos 7UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_TXFEMP_Msk 0x80UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_TXFIFOUNDRN_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_TXFIFOUNDRN_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DIEPINT8_NYETINTRPT_Msk 0x4000UL
/* USBHS_DWC_OTG_INTREG.DIEPTSIZ8 */
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ8_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ8_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ8_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ8_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ8_MC_Pos   29UL
#define USBHS_DWC_OTG_INTREG_DIEPTSIZ8_MC_Msk   0x60000000UL
/* USBHS_DWC_OTG_INTREG.DIEPDMA8 */
#define USBHS_DWC_OTG_INTREG_DIEPDMA8_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMA8_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DTXFSTS8 */
#define USBHS_DWC_OTG_INTREG_DTXFSTS8_INEPTXFSPCAVAIL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DTXFSTS8_INEPTXFSPCAVAIL_Msk 0xFFFFUL
/* USBHS_DWC_OTG_INTREG.DIEPDMAB8 */
#define USBHS_DWC_OTG_INTREG_DIEPDMAB8_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DIEPDMAB8_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL0 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_MPS_Msk   0x3UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL0_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT0 */
#define USBHS_DWC_OTG_INTREG_DOEPINT0_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT0_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ0 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ0_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ0_XFERSIZE_Msk 0x7FUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ0_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ0_PKTCNT_Msk 0x80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ0_SUPCNT_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ0_SUPCNT_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA0 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA0_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA0_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB0 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB0_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB0_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL1 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL1_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT1 */
#define USBHS_DWC_OTG_INTREG_DOEPINT1_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT1_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ1 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ1_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ1_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ1_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ1_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ1_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ1_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA1 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA1_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA1_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB1 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB1_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB1_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL2 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL2_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT2 */
#define USBHS_DWC_OTG_INTREG_DOEPINT2_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT2_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ2 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ2_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ2_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ2_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ2_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ2_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ2_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA2 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA2_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA2_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB2 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB2_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB2_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL3 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL3_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT3 */
#define USBHS_DWC_OTG_INTREG_DOEPINT3_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_STSPHSERCVD_Pos 5UL
