PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
#define USBHS_DWC_OTG_INTREG_DOEPINT3_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT3_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ3 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ3_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ3_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ3_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ3_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ3_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ3_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA3 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA3_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA3_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB3 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB3_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB3_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL4 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL4_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT4 */
#define USBHS_DWC_OTG_INTREG_DOEPINT4_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT4_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ4 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ4_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ4_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ4_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ4_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ4_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ4_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA4 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA4_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA4_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB4 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB4_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB4_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL5 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL5_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT5 */
#define USBHS_DWC_OTG_INTREG_DOEPINT5_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT5_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ5 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ5_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ5_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ5_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ5_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ5_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ5_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA5 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA5_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA5_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB5 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB5_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB5_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL6 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL6_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT6 */
#define USBHS_DWC_OTG_INTREG_DOEPINT6_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT6_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ6 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ6_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ6_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ6_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ6_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ6_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ6_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA6 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA6_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA6_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB6 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB6_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB6_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL7 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL7_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT7 */
#define USBHS_DWC_OTG_INTREG_DOEPINT7_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT7_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ7 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ7_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ7_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ7_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ7_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ7_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ7_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA7 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA7_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA7_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB7 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB7_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB7_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPCTL8 */
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_MPS_Pos   0UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_MPS_Msk   0x7FFUL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_USBACTEP_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_USBACTEP_Msk 0x8000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_DPID_Pos  16UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_DPID_Msk  0x10000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_NAKSTS_Pos 17UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_NAKSTS_Msk 0x20000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_EPTYPE_Pos 18UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_EPTYPE_Msk 0xC0000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SNP_Pos   20UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SNP_Msk   0x100000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_STALL_Pos 21UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_STALL_Msk 0x200000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_CNAK_Pos  26UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_CNAK_Msk  0x4000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SNAK_Pos  27UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SNAK_Msk  0x8000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SETD0PID_Pos 28UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SETD0PID_Msk 0x10000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SETD1PID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_SETD1PID_Msk 0x20000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_EPDIS_Pos 30UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_EPDIS_Msk 0x40000000UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_EPENA_Pos 31UL
#define USBHS_DWC_OTG_INTREG_DOEPCTL8_EPENA_Msk 0x80000000UL
/* USBHS_DWC_OTG_INTREG.DOEPINT8 */
#define USBHS_DWC_OTG_INTREG_DOEPINT8_XFERCOMPL_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_XFERCOMPL_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_EPDISBLD_Pos 1UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_EPDISBLD_Msk 0x2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_AHBERR_Pos 2UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_AHBERR_Msk 0x4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_SETUP_Pos 3UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_SETUP_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_OUTTKNEPDIS_Pos 4UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_OUTTKNEPDIS_Msk 0x10UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_STSPHSERCVD_Pos 5UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_STSPHSERCVD_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_BACK2BACKSETUP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_BACK2BACKSETUP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_OUTPKTERR_Pos 8UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_OUTPKTERR_Msk 0x100UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_BNAINTR_Pos 9UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_BNAINTR_Msk 0x200UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_PKTDRPSTS_Pos 11UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_PKTDRPSTS_Msk 0x800UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_BBLEERR_Pos 12UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_BBLEERR_Msk 0x1000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_NAKINTRPT_Pos 13UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_NAKINTRPT_Msk 0x2000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_NYETINTRPT_Pos 14UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_NYETINTRPT_Msk 0x4000UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_STUPPKTRCVD_Pos 15UL
#define USBHS_DWC_OTG_INTREG_DOEPINT8_STUPPKTRCVD_Msk 0x8000UL
/* USBHS_DWC_OTG_INTREG.DOEPTSIZ8 */
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ8_XFERSIZE_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ8_XFERSIZE_Msk 0x7FFFFUL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ8_PKTCNT_Pos 19UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ8_PKTCNT_Msk 0x1FF80000UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ8_RXDPID_Pos 29UL
#define USBHS_DWC_OTG_INTREG_DOEPTSIZ8_RXDPID_Msk 0x60000000UL
/* USBHS_DWC_OTG_INTREG.DOEPDMA8 */
#define USBHS_DWC_OTG_INTREG_DOEPDMA8_DMAADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMA8_DMAADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.DOEPDMAB8 */
#define USBHS_DWC_OTG_INTREG_DOEPDMAB8_DMABUFFERADDR_Pos 0UL
#define USBHS_DWC_OTG_INTREG_DOEPDMAB8_DMABUFFERADDR_Msk 0xFFFFFFFFUL
/* USBHS_DWC_OTG_INTREG.PCGCCTL */
#define USBHS_DWC_OTG_INTREG_PCGCCTL_STOPPCLK_Pos 0UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_STOPPCLK_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_RSTPDWNMODULE_Pos 3UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_RSTPDWNMODULE_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_ENBL_L1GATING_Pos 5UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_ENBL_L1GATING_Msk 0x20UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_PHYSLEEP_Pos 6UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_PHYSLEEP_Msk 0x40UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_L1SUSPENDED_Pos 7UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL_L1SUSPENDED_Msk 0x80UL
/* USBHS_DWC_OTG_INTREG.PCGCCTL1 */
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_GATEEN_Pos 0UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_GATEEN_Msk 0x1UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_COUNTER_Pos 1UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_COUNTER_Msk 0x6UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_RAMGATEEN_Pos 3UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_RAMGATEEN_Msk 0x8UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_RESERVED_Pos 4UL
#define USBHS_DWC_OTG_INTREG_PCGCCTL1_RESERVED_Msk 0xFFFFFFF0UL


