PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_usbhs.h
/* USBHS_SS.SUBSYSTEM_CTL */
#define USBHS_SS_SUBSYSTEM_CTL_SS_ENABLE_Pos    0UL
#define USBHS_SS_SUBSYSTEM_CTL_SS_ENABLE_Msk    0x1UL
#define USBHS_SS_SUBSYSTEM_CTL_USB_MODE_Pos     1UL
#define USBHS_SS_SUBSYSTEM_CTL_USB_MODE_Msk     0x2UL
#define USBHS_SS_SUBSYSTEM_CTL_USB_PHY_POWER_DOWN_Pos 2UL
#define USBHS_SS_SUBSYSTEM_CTL_USB_PHY_POWER_DOWN_Msk 0x4UL
#define USBHS_SS_SUBSYSTEM_CTL_AHB_MASTER_SYNC_Pos 3UL
#define USBHS_SS_SUBSYSTEM_CTL_AHB_MASTER_SYNC_Msk 0x8UL
#define USBHS_SS_SUBSYSTEM_CTL_USB_CTRL_SCALEDOWN_MODE_Pos 4UL
#define USBHS_SS_SUBSYSTEM_CTL_USB_CTRL_SCALEDOWN_MODE_Msk 0x30UL
#define USBHS_SS_SUBSYSTEM_CTL_SS_FORCED_SHUTDOWN_Pos 6UL
#define USBHS_SS_SUBSYSTEM_CTL_SS_FORCED_SHUTDOWN_Msk 0x40UL
#define USBHS_SS_SUBSYSTEM_CTL_RSVD_1_Pos       7UL
#define USBHS_SS_SUBSYSTEM_CTL_RSVD_1_Msk       0xFFFFFF80UL
/* USBHS_SS.PHY_FUNC_CTL_1 */
#define USBHS_SS_PHY_FUNC_CTL_1_PLL_B_TUNE_Pos  0UL
#define USBHS_SS_PHY_FUNC_CTL_1_PLL_B_TUNE_Msk  0x1UL
#define USBHS_SS_PHY_FUNC_CTL_1_PLL_FSEL_Pos    1UL
#define USBHS_SS_PHY_FUNC_CTL_1_PLL_FSEL_Msk    0xEUL
#define USBHS_SS_PHY_FUNC_CTL_1_DISCONNECT_THRESHOLD_Pos 4UL
#define USBHS_SS_PHY_FUNC_CTL_1_DISCONNECT_THRESHOLD_Msk 0x70UL
#define USBHS_SS_PHY_FUNC_CTL_1_SQUELCH_THRESHOLD_Pos 7UL
#define USBHS_SS_PHY_FUNC_CTL_1_SQUELCH_THRESHOLD_Msk 0x380UL
#define USBHS_SS_PHY_FUNC_CTL_1_CHARGER_TYPE_DETECTION_Pos 10UL
#define USBHS_SS_PHY_FUNC_CTL_1_CHARGER_TYPE_DETECTION_Msk 0xC00UL
#define USBHS_SS_PHY_FUNC_CTL_1_TX_HS_CROSSOVER_Pos 12UL
#define USBHS_SS_PHY_FUNC_CTL_1_TX_HS_CROSSOVER_Msk 0x3000UL
#define USBHS_SS_PHY_FUNC_CTL_1_FS_LS_SOURCE_IMPEDANCE_Pos 14UL
#define USBHS_SS_PHY_FUNC_CTL_1_FS_LS_SOURCE_IMPEDANCE_Msk 0x3C000UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_DC_VOLTAGE_Pos 18UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_DC_VOLTAGE_Msk 0x3C0000UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_TX_RISETUNE_Pos 22UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_TX_RISETUNE_Msk 0xC00000UL
#define USBHS_SS_PHY_FUNC_CTL_1_USB_SOURCE_IMPEDANCE_Pos 24UL
#define USBHS_SS_PHY_FUNC_CTL_1_USB_SOURCE_IMPEDANCE_Msk 0x3000000UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_TX_PRE_EMPHASIS_CURRENT_Pos 26UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_TX_PRE_EMPHASIS_CURRENT_Msk 0xC000000UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_TX_PRE_EMPHASIS_DURATION_Pos 28UL
#define USBHS_SS_PHY_FUNC_CTL_1_HS_TX_PRE_EMPHASIS_DURATION_Msk 0x10000000UL
#define USBHS_SS_PHY_FUNC_CTL_1_PORT_RESET_Pos  29UL
#define USBHS_SS_PHY_FUNC_CTL_1_PORT_RESET_Msk  0x20000000UL
#define USBHS_SS_PHY_FUNC_CTL_1_PLL_I_TUNE_Pos  30UL
#define USBHS_SS_PHY_FUNC_CTL_1_PLL_I_TUNE_Msk  0xC0000000UL
/* USBHS_SS.PHY_FUNC_CTL_2 */
#define USBHS_SS_PHY_FUNC_CTL_2_PLL_P_TUNE_Pos  0UL
#define USBHS_SS_PHY_FUNC_CTL_2_PLL_P_TUNE_Msk  0xFUL
#define USBHS_SS_PHY_FUNC_CTL_2_OTG_TUNE_Pos    4UL
#define USBHS_SS_PHY_FUNC_CTL_2_OTG_TUNE_Msk    0x70UL
#define USBHS_SS_PHY_FUNC_CTL_2_RES_TUNING_CODE_Pos 7UL
#define USBHS_SS_PHY_FUNC_CTL_2_RES_TUNING_CODE_Msk 0x780UL
#define USBHS_SS_PHY_FUNC_CTL_2_RES_TUNING_SEL_Pos 11UL
#define USBHS_SS_PHY_FUNC_CTL_2_RES_TUNING_SEL_Msk 0x800UL
#define USBHS_SS_PHY_FUNC_CTL_2_EFUSE_SEL_Pos   12UL
#define USBHS_SS_PHY_FUNC_CTL_2_EFUSE_SEL_Msk   0x1000UL
#define USBHS_SS_PHY_FUNC_CTL_2_RSVD_2_Pos      13UL
#define USBHS_SS_PHY_FUNC_CTL_2_RSVD_2_Msk      0xFFFFE000UL
/* USBHS_SS.PHY_TEST_CTL */
#define USBHS_SS_PHY_TEST_CTL_TEST_PULSE_Pos    0UL
#define USBHS_SS_PHY_TEST_CTL_TEST_PULSE_Msk    0x1UL
#define USBHS_SS_PHY_TEST_CTL_TEST_DATAOUT_SEL0_Pos 1UL
#define USBHS_SS_PHY_TEST_CTL_TEST_DATAOUT_SEL0_Msk 0x2UL
#define USBHS_SS_PHY_TEST_CTL_TEST_DATAIN0_Pos  2UL
#define USBHS_SS_PHY_TEST_CTL_TEST_DATAIN0_Msk  0x3FCUL
#define USBHS_SS_PHY_TEST_CTL_TEST_ADDR0_Pos    10UL
#define USBHS_SS_PHY_TEST_CTL_TEST_ADDR0_Msk    0x3C00UL
#define USBHS_SS_PHY_TEST_CTL_TEST_BURNIN_Pos   14UL
#define USBHS_SS_PHY_TEST_CTL_TEST_BURNIN_Msk   0x4000UL
#define USBHS_SS_PHY_TEST_CTL_TEST_SCAN_EN_Pos  15UL
#define USBHS_SS_PHY_TEST_CTL_TEST_SCAN_EN_Msk  0x8000UL
#define USBHS_SS_PHY_TEST_CTL_TEST_IDDQ_EN_Pos  16UL
#define USBHS_SS_PHY_TEST_CTL_TEST_IDDQ_EN_Msk  0x10000UL
#define USBHS_SS_PHY_TEST_CTL_TEST_LOOPBACK_EN_Pos 17UL
#define USBHS_SS_PHY_TEST_CTL_TEST_LOOPBACK_EN_Msk 0x20000UL
#define USBHS_SS_PHY_TEST_CTL_TEST_ANALOGPIN_SEL_Pos 18UL
#define USBHS_SS_PHY_TEST_CTL_TEST_ANALOGPIN_SEL_Msk 0xC0000UL
#define USBHS_SS_PHY_TEST_CTL_TEST_ATERESET_Pos 20UL
#define USBHS_SS_PHY_TEST_CTL_TEST_ATERESET_Msk 0x100000UL
#define USBHS_SS_PHY_TEST_CTL_RSVD_3_Pos        21UL
#define USBHS_SS_PHY_TEST_CTL_RSVD_3_Msk        0xFFE00000UL
/* USBHS_SS.CONTROLLER_DDFT_CTL */
#define USBHS_SS_CONTROLLER_DDFT_CTL_DEBUG_HCLK_PROBES_COUNT_Pos 0UL
#define USBHS_SS_CONTROLLER_DDFT_CTL_DEBUG_HCLK_PROBES_COUNT_Msk 0x3FUL
#define USBHS_SS_CONTROLLER_DDFT_CTL_DEBUG_PCLK_PROBES_COUNT_Pos 6UL
#define USBHS_SS_CONTROLLER_DDFT_CTL_DEBUG_PCLK_PROBES_COUNT_Msk 0x3FC0UL
#define USBHS_SS_CONTROLLER_DDFT_CTL_RSVD_4_Pos 14UL
#define USBHS_SS_CONTROLLER_DDFT_CTL_RSVD_4_Msk 0xFFFFC000UL
/* USBHS_SS.INTR_SS */
#define USBHS_SS_INTR_SS_QCH_HCLK_GATED_Pos     0UL
#define USBHS_SS_INTR_SS_QCH_HCLK_GATED_Msk     0x1UL
#define USBHS_SS_INTR_SS_QCH_REQ_ERR_Pos        1UL
#define USBHS_SS_INTR_SS_QCH_REQ_ERR_Msk        0x2UL
/* USBHS_SS.INTR_SS_SET */
#define USBHS_SS_INTR_SS_SET_QCH_HCLK_GATED_Pos 0UL
#define USBHS_SS_INTR_SS_SET_QCH_HCLK_GATED_Msk 0x1UL
#define USBHS_SS_INTR_SS_SET_QCH_REQ_ERR_Pos    1UL
#define USBHS_SS_INTR_SS_SET_QCH_REQ_ERR_Msk    0x2UL
/* USBHS_SS.INTR_SS_MASK */
#define USBHS_SS_INTR_SS_MASK_QCH_HCLK_GATED_Pos 0UL
#define USBHS_SS_INTR_SS_MASK_QCH_HCLK_GATED_Msk 0x1UL
#define USBHS_SS_INTR_SS_MASK_QCH_REQ_ERR_Pos   1UL
#define USBHS_SS_INTR_SS_MASK_QCH_REQ_ERR_Msk   0x2UL
/* USBHS_SS.INTR_SS_MASKED */
#define USBHS_SS_INTR_SS_MASKED_QCH_HCLK_GATED_Pos 0UL
#define USBHS_SS_INTR_SS_MASKED_QCH_HCLK_GATED_Msk 0x1UL
#define USBHS_SS_INTR_SS_MASKED_QCH_REQ_ERR_Pos 1UL
#define USBHS_SS_INTR_SS_MASKED_QCH_REQ_ERR_Msk 0x2UL


#endif /* _CYIP_USBHS_H_ */


/* [] END OF FILE */
